{
    "apiVersion": "2.0",
    "documentationUrl": "https:\/\/jobi.cy\/apidocs",
    "friendlyNotice": "We appreciate your use of Jobicy API in your projects! Please note that our API access is designed primarily to facilitate broader distribution of our content. We kindly request that you refrain from distributing Jobicy’s job listings to any external job platforms, such as Jooble, Google Jobs, and LinkedIn, among others. To ensure that Jobicy is credited as the original source across various platforms, content in the feeds is published with a slight delay. As our data doesn't change frequently, accessing the Feed a few times daily is sufficient and recommended. Be advised that excessive querying may lead to restricted access. Thank you for understanding and cooperating!",
    "jobCount": 20,
    "xRayHash": "xID_674375d372ea89.46252729",
    "clientKey": "key_674375d372eae",
    "lastUpdate": "2024-11-24 05:00:49",
    "jobs": [
        {
            "id": 108743,
            "url": "https:\/\/jobicy.com\/jobs\/108743-senior-python-developer",
            "jobSlug": "108743-senior-python-developer",
            "jobTitle": "Senior Python Developer",
            "companyName": "Lumenalta",
            "companyLogo": "https:\/\/jobicy.com\/data\/server-nyc0409\/galaxy\/mercury\/2024\/01\/22ced37d-221.jpeg",
            "jobIndustry": [
                "Programming"
            ],
            "jobType": [
                "full-time"
            ],
            "jobGeo": "Anywhere",
            "jobLevel": "Senior",
            "jobExcerpt": "A career at Lumenalta means the freedom to continue your tech career on your terms. Build exceptional things from wherever you might be. Experience Remote done Right. Over 20 years of remote experience, all 600+ staff are 100% remote and we still grow vibrant relationships, provide exceptional opportunities for career growth while working with stellar&#8230;",
            "jobDescription": "<p>A career at Lumenalta means the freedom to continue your tech career on your terms. Build exceptional things from wherever you might be.<\/p>\n<p>Experience Remote done Right. Over 20 years of remote experience, all 600+ staff are 100% remote and we still grow vibrant relationships, provide exceptional opportunities for career growth while working with stellar clients on ambitious projects<\/p>\n<h2>What we&#8217;re working on<\/h2>\n<p>Enterprise companies turn to us to help them launch innovative digital products that interact with hundreds of millions of customers, transactions and data points. The problems we solve every day are real and require creativity, grit and determination. We are building a culture that challenges norms while fostering experimentation and personal growth. In order to grasp the scale of problems we face, ideally, you have some exposure to Logistics, FinTech, Transportation, Insurance, Media or other complex multifactor industries.<\/p>\n<h2>Requirements<\/h2>\n<ul>\n<li>7+ years experience in a senior developer role; ideally, you have delivered business-critical software to large enterprises<\/li>\n<li>4+ years hands-on experience with the Django framework<\/li>\n<li>Experience with Power BI, PowerApps, and Azure<\/li>\n<li>Previous experience with Django rest Framework will be advantageous<\/li>\n<li>Ability to craft new API specifications and develop to provided specifications<\/li>\n<li>Ability to think about long-term maintenance when creating or making changes<\/li>\n<li>English fluency, verbal and written<\/li>\n<li>Professional, empathic, team player<\/li>\n<li>Problem solver, proactive, go-getter<\/li>\n<\/ul>\n<h2>Why Lumenalta is an amazing place to work at<\/h2>\n<p>At Lumenalta, you can expect that you will:<\/p>\n<ul>\n<li>Be 100% dedicated to one project at a time so that you can innovate and grow.<\/li>\n<li>Be a part of a team of talented and friendly senior-level developers.<\/li>\n<li>Work on projects that allow you to use leading tech.<\/li>\n<\/ul>\n<p>The result? We produce meaningful outcomes for our clients that break barriers in their industries. The Job is 100% remote; please ensure you have a comfortable office setup at your desired work location.<\/p>\n<p>Lumenalta is committed to hiring exceptional talent from a wide variety of diverse backgrounds. If you share our values and enthusiasm for digital transformation, we encourage you to apply<\/p>",
            "pubDate": "2024-11-24 05:00:49"
        },
        {
            "id": 104364,
            "url": "https:\/\/jobicy.com\/jobs\/104364-senior-front-end-engineer-5",
            "jobSlug": "104364-senior-front-end-engineer-5",
            "jobTitle": "Sr. Software Engineer, Platform",
            "companyName": "Timescale",
            "companyLogo": "https:\/\/jobicy.com\/data\/server-nyc0409\/galaxy\/mercury\/2023\/10\/43d37c6e-221.jpeg",
            "jobIndustry": [
                "Software Engineering"
            ],
            "jobType": [
                "full-time"
            ],
            "jobGeo": "Anywhere",
            "jobLevel": "Senior",
            "jobExcerpt": "At Timescale, we empower businesses with real-time insights from their data, allowing them to make faster decisions and optimize operations. We are creating a movement to unblock developers who are building the future. Timescale is a product-led growth organization driven by transparent leaders and a globally diverse, remote-first team that is proudly building a modern&#8230;",
            "jobDescription": "<p>At Timescale, we empower businesses with real-time insights from their data, allowing them to make faster decisions and optimize operations. We are creating a movement to unblock developers who are building the future. Timescale is a product-led growth organization driven by transparent leaders and a globally diverse, remote-first team that is proudly building a modern PostgreSQL cloud platform.<\/p>\n<p>We&#8217;re looking for experienced engineers to help us build and maintain the platform for our managed TimescaleDB cloud services. You will work with a close-knit team, building and maintaining the infrastructure that powers our platform. Your work will be instrumental in developing our Kubernetes-based clusters and infrastructure. This role is perfect if you enjoy solving complex infrastructure challenges and automating workflows.<\/p>\n<p>This is a remote and a full-time position.<\/p>\n<h2><strong>What you will be responsible for<\/strong><\/h2>\n<ul>\n<li>You will interact with the Kubernetes API and codebase to build controllers, operators, and applications that power our platform.<\/li>\n<li>Work closely with and further develop our infrastructure tooling to ensure the health, stability, and maintainability of our clusters.<\/li>\n<li>Get a lot of hands-on experience debugging and optimizing TimescaleDB and Postgres workloads.<\/li>\n<li>Collaborate with software engineering teams to ensure platform scalability and performance.<\/li>\n<li>Stay up to date with the latest industry trends, tools, and technologies related to Kubernetes and cloud infrastructure.<\/li>\n<\/ul>\n<h2><strong>You’d be a great fit if you have<\/strong><\/h2>\n<ul>\n<li>5+ years of experience in platform engineering<\/li>\n<li>Experience programming in the Kubernetes ecosystem or using the Kubernetes API (operators, controllers, and custom CRDs)<\/li>\n<li>Strong programming skills (we mostly use Go)<\/li>\n<li>Extensive experience with at least one major cloud provider (AWS preferred)<\/li>\n<li>Experience designing, understanding, and debugging complex distributed systems<\/li>\n<li>Deep knowledge of Linux, container environments, bash, and infrastructure as code (e.g., Terraform, Pulumi)<\/li>\n<li>Experience deploying, operating, and using major production-level databases. Bonus points for PostgreSQL and\/or TimescaleDB!<\/li>\n<li>Experience deploying and maintaining Kubernetes clusters at scale. Knowledge of Kubernetes cluster orchestration tools like kops or kubeadm is a plus<\/li>\n<li>Experience with CNI and CSI interfaces. Have an understanding of their purpose and solid experience with at least one CNI and CSI plugin &#8211; deploying, tuning, troubleshooting.<\/li>\n<li>A good understanding of feature sets of different Kubernetes versions, be well informed about new features.<\/li>\n<li>Understand different solutions for monitoring kubernetes health and troubleshooting, improving control plane and worker node performance.<\/li>\n<li>Have experience tuning kubernetes components such as API server, kubelet, scheduler, kube-proxy, controller manager, for improving performance, security hardening and improvement of reliability.<\/li>\n<li>Experience of managing self hosted kubernetes clusters (not only EKS, AKS or GKE) is a plus.<\/li>\n<\/ul>\n<h2><strong>You might not be a great fit if<\/strong><\/h2>\n<ul>\n<li>You aren&#8217;t comfortable with a fast-paced, dynamic environment where priorities can shift quickly.<\/li>\n<li>You prefer a highly structured role with clearly defined tasks and responsibilities.<\/li>\n<li>You&#8217;re not a self-starter who thrives on taking initiative and ownership.<\/li>\n<\/ul>\n<h2><strong>Our Commitment<\/strong><\/h2>\n<ul>\n<li>We will respond to all applicants<\/li>\n<li>We strive to review all applications fairly, without bias, and shortlist based on relevant skills and experience.<\/li>\n<li>All active candidates will be informed of what is happening next in the process.<\/li>\n<\/ul>\n<h2><strong>About Timescale<\/strong><\/h2>\n<p>Timescale is the creator of TimescaleDB and PGVectorscale, trusted by tens of thousands of organizations for their mission-critical time-series applications. We&#8217;re committed to empowering developers and businesses worldwide, helping them build data-driven products that measure everything that matters—from software applications and industrial equipment to financial markets, blockchain activity, consumer behavior, machine learning models, and climate change.<\/p>\n<p>By analyzing data across time (“time-series data”), developers gain insights into what’s happening, how it’s changing, and why. With a global, fully remote workforce, Timescale is supported by top investors, including Tiger Global, Benchmark Capital, NEA, Redpoint Ventures, Icon Ventures, and Two Sigma Ventures.<\/p>\n<p>Enjoy debating the crunch-factor of different chicken nuggets , sweating it out during lunch , talking about your kids, whether they be actual children , potted plants , or four-legged creatures ? You’ll fit right in at Timescale!<\/p>\n<h2><strong>Our Tech stack<\/strong><\/h2>\n<p><em>We share our tech stack with the caveat that we don’t require previous experience in it (but a love of these languages is helpful):<\/em> Timescale&#8217;s tech stack includes TimescaleDB, built on PostgreSQL, along with AWS, Go, Docker, Kubernetes, and Python for scalable time-series data management.<\/p>\n<h2><strong>What we’re offering<\/strong><\/h2>\n<p><em>Benefits may differ from country to country.<\/em><\/p>\n<ul>\n<li>Flexible PTO and family leave<\/li>\n<li>Fridays off in August <\/li>\n<li>Full remote work from almost <em>anywhere<\/em><\/li>\n<li>Stock options<\/li>\n<li>Monthly WiFi stipend<\/li>\n<li>Professional development and educational benefits <\/li>\n<li>Premium insurance options for you and your family <em>(US employees)<\/em><\/li>\n<\/ul>",
            "pubDate": "2024-11-23 04:45:25"
        },
        {
            "id": 106709,
            "url": "https:\/\/jobicy.com\/jobs\/106709-customer-success-manager",
            "jobSlug": "106709-customer-success-manager",
            "jobTitle": "Account Executive",
            "companyName": "Timescale",
            "companyLogo": "https:\/\/jobicy.com\/data\/server-nyc0409\/galaxy\/mercury\/2023\/10\/43d37c6e-221.jpeg",
            "jobIndustry": [
                "Sales"
            ],
            "jobType": [
                "full-time"
            ],
            "jobGeo": "USA",
            "jobLevel": "Any",
            "jobExcerpt": "At Timescale, we empower businesses with real-time insights from their data, allowing them to make faster decisions and optimize operations. We are creating a movement to unblock developers who are building the future. Timescale is a product-led growth organization driven by transparent leaders and a globally diverse, remote-first team that is proudly building a modern&#8230;",
            "jobDescription": "<p>At Timescale, we empower businesses with real-time insights from their data, allowing them to make faster decisions and optimize operations. We are creating a movement to unblock developers who are building the future. Timescale is a product-led growth organization driven by transparent leaders and a globally diverse, remote-first team that is proudly building a modern PostgreSQL cloud platform.<\/p>\n<p>In this role, you will be at the forefront of closing deals and providing solutions in our growing database market. You can make a meaningful impact by helping organizations harness the power of data for better decision-making, improved operations, and innovation. You will manage complex sales relationships with critical customers and effectively communicate the value of Timescale. As the company and industry expand, we see our high-growth market as an opportunity for significant sales and career advancement.<\/p>\n<h2><strong>What you will be responsible for in this role:<\/strong><\/h2>\n<ul>\n<li>Focus on closing Sales Qualified Leads (SQL) from the marketing team.<\/li>\n<li>Qualify leads based on their challenges and alignment with our product suite.<\/li>\n<li>Strategically prospect into CTOs, Engineering Leads, and Technical End Users.<\/li>\n<li>Manage the full sales cycle.<\/li>\n<li>Leverage resources such as Sales Engineers and Data Architects effectively.<\/li>\n<li>Guide relevant stakeholders through the sales process to close.<\/li>\n<\/ul>\n<h2><strong>You could be a great fit if: <\/strong><\/h2>\n<ul>\n<li>3-5 years of experience in a full-cycle quota-carrying Saas sales role<\/li>\n<li>Technical background with a deep understanding of database technology, data platforms, open source, and cloud ecosystems<\/li>\n<li>Ability to articulate the business value of complex enterprise technology<\/li>\n<li>Proficiency in modern sales software (e.g., Salesforce, Outreach, etc.).<\/li>\n<li>Proven track record of exceeding sales targets and driving revenue growth.<\/li>\n<li>Strong interpersonal skills with the ability to build rapport and establish trust with customers.<\/li>\n<li>Demonstrated ability to manage multiple priorities in a fast-paced environment effectively.<\/li>\n<li>Entrepreneurial mindset with a proactive approach to problem-solving.<\/li>\n<\/ul>\n<h2><strong>Bonus Skills: <\/strong><\/h2>\n<ul>\n<li>You are a top performer with a proven track record, and you know that your success directly depends on your customers&#8217; success.<\/li>\n<li>You always put the customer&#8217;s best interests first while managing complex sales engagements and effectively leveraging resources to ensure success.<\/li>\n<li>You are hungry, resilient, curious, driven, and humble in your pursuit of excellence.<\/li>\n<li>You aren’t afraid to speak up and identify problem areas or share your ideas, and you want to be a part of the solution!<\/li>\n<\/ul>\n<p>You are a builder who is passionate about creatively trying new things and contributing to our growth by exploring innovative solutions .<\/p>\n<h2><strong>You might not be a great fit if: <\/strong><\/h2>\n<ul>\n<li>You aren&#8217;t comfortable with a fast-paced, dynamic environment where priorities can shift quickly.<\/li>\n<li>You prefer a highly structured role with clearly defined tasks and responsibilities.<\/li>\n<li>You&#8217;re not comfortable with or excited about learning technical concepts<\/li>\n<li>You&#8217;re not a self-starter who thrives on taking initiative and ownership.<\/li>\n<li>You prefer to work independently and aren&#8217;t a strong team player.<\/li>\n<\/ul>\n<p><em>While Timescale operates primarily as a remote organization, we strongly prefer candidates located in San Francisco, CA, and New York City, NY, to facilitate frequent collaboration and connection with local team members<\/em><\/p>\n<h2><strong>Our Commitment:<\/strong><\/h2>\n<ul>\n<li>We will respond to all applicants<\/li>\n<li>We strive to review all applications fairly, without bias, and shortlist based on relevant skills and experience.<\/li>\n<li>All active candidates will be informed of what is happening next in the process.<\/li>\n<\/ul>\n<h2><strong>About Timescale<\/strong><\/h2>\n<p>Timescale is the creator of TimescaleDB and PGVectorscale, trusted by tens of thousands of organizations for their mission-critical time-series applications. We&#8217;re committed to empowering developers and businesses worldwide, helping them build data-driven products that measure everything that matters—from software applications and industrial equipment to financial markets, blockchain activity, consumer behavior, machine learning models, and climate change.<\/p>\n<p>By analyzing data across time (“time-series data”), developers gain insights into what’s happening, how it’s changing, and why. With a global, fully remote workforce, Timescale is supported by top investors, including Tiger Global, Benchmark Capital, NEA, Redpoint Ventures, Icon Ventures, and Two Sigma Ventures.<\/p>\n<p>Enjoy debating the crunch-factor of different chicken nuggets , sweating it out during lunch , talking about your kids, whether they be actual children , potted plants , or four-legged creatures ? You’ll fit right in at Timescale!<\/p>\n<h2><strong>Our Tech stack: <\/strong><\/h2>\n<p><em>We share our tech stack with the caveat that we don’t require previous experience in it (but a love of these languages is helpful):<\/em> Timescale&#8217;s tech stack includes TimescaleDB, built on PostgreSQL, along with AWS, Go, Docker, Kubernetes, and Python for scalable time-series data management.<\/p>\n<h2><strong>What we’re offering<\/strong><\/h2>\n<p><em>Benefits may differ from country to country.<\/em><\/p>\n<ul>\n<li>Flexible PTO and family leave<\/li>\n<li>Fridays off in August <\/li>\n<li>Full remote work from almost <em>anywhere<\/em><\/li>\n<li>Stock options<\/li>\n<li>Monthly WiFi stipend<\/li>\n<li>Professional development and educational benefits <\/li>\n<li>Premium insurance options for you and your family <em>(US employees)<\/em><\/li>\n<\/ul>",
            "pubDate": "2024-11-23 04:45:09"
        },
        {
            "id": 109901,
            "url": "https:\/\/jobicy.com\/jobs\/109901-senior-backend-engineer-ad-signals",
            "jobSlug": "109901-senior-backend-engineer-ad-signals",
            "jobTitle": "Backend Engineer - Ads Billing",
            "companyName": "Reddit",
            "companyLogo": "https:\/\/jobicy.com\/data\/server-nyc0409\/galaxy\/mercury\/2020\/10\/Reddit.jpg",
            "jobIndustry": [
                "Software Engineering"
            ],
            "jobType": [
                "full-time"
            ],
            "jobGeo": "USA",
            "jobLevel": "Any",
            "jobExcerpt": "Reddit is a community of communities. It’s built on shared interests, passion, and trust and is home to the most open and authentic conversations on the internet. Every day, Reddit users submit, vote, and comment on the topics they care most about. With 100,000+ active communities and approximately 97M+ daily active unique visitors, Reddit is&#8230;",
            "jobDescription": "<p>Reddit is a community of communities. It’s built on shared interests, passion, and trust and is home to the most open and authentic conversations on the internet. Every day, Reddit users submit, vote, and comment on the topics they care most about. With 100,000+ active communities and approximately 97M+ daily active unique visitors, Reddit is one of the internet’s largest sources of information.<\/p>\n<p><strong>Backend Engineer &#8211; Ads Billing (Revenue Lifecycle)<\/strong><\/p>\n<p>The Ads Billing (Revenue Lifecycle) team plays a pivotal role in managing bills for advertisers and ensuring the accuracy of internal and external revenue reporting. The primary responsibilities of this team encompass maintaining data pipelines crucial for billing operations and ledger management, introducing new features, and providing support and on-call for the team&#8217;s designated domains.<\/p>\n<p>The team is a part of Advertiser Platform org and represents the connection in the ad serving stack to the upstream data sources of the event pipelines. We ingest ad events to determine billability and then accrue spending into ledgers. We use this data in our automated payments platform and pass data to the downstream systems for billing and reporting. This data is also used for revenue recognition which is critical for a public company. We own the payment experience for advertisers and work with internal teams to support that experience.<\/p>\n<p>We are looking for a skilled backend software engineer to join our team. You will directly impact the billing and payment experience for Reddit advertisers and enhance internal and external revenue reporting processes. As a key contributor to our team, you’ll have the opportunity to work on a range of exciting projects such as.<\/p>\n<ul>\n<li>Build customizable spend control for advertisers<\/li>\n<li>Building or re-architecting components of an in-house system for invoice generation<\/li>\n<li>Expanding the range of supported payment methods at Reddit<\/li>\n<\/ul>\n<h2><strong>Responsibilities: <\/strong><\/h2>\n<ul>\n<li>Develop, maintain, and scale revenue data ingestion pipeline using cutting-edge technologies<\/li>\n<li>Contribute to the development of dashboards to expedite revenue reporting and unleash sales productivity.<\/li>\n<li>Produce robust and sustainable code and demonstrate proficiency in debugging systems beyond your immediate responsibilities.<\/li>\n<li>Uphold high-quality standards within the team.<\/li>\n<li>Contribute innovative ideas and directly impact the team&#8217;s roadmap while collaborating closely with cross-functional stakeholders.<\/li>\n<\/ul>\n<h2><strong>Technologies used on the team include:<\/strong><\/h2>\n<ul>\n<li>Languages: Python, Scala, Go<\/li>\n<li>Frameworks: Thrift, Baseplate, Kafka, GraphQL<\/li>\n<li>Datastores: Postgres, Druid, Redis, BigQuery<\/li>\n<li>Tools: Kubernetes, Airflow<\/li>\n<\/ul>\n<h2><strong>What We&#8217;re Looking For:<\/strong><\/h2>\n<ul>\n<li>A Bachelor&#8217;s degree or higher in a quantitative or computer science-related field (e.g., mathematics, statistics, economics, finance, computer science)<\/li>\n<li>Full-time backend software engineering experience in a highly scalable computing environment<\/li>\n<li>Experience in backend development, with a passion for learning and adapting to new technologies that you lacked prior experience with<\/li>\n<li>Strong communication and collaboration skills, with the ability to work effectively with diverse stakeholders independently<\/li>\n<\/ul>\n<h2><strong>Nice to Have:<\/strong><\/h2>\n<ul>\n<li>Prior experience in the ads  or billing space, with a deep understanding of the challenges and opportunities in these areas<\/li>\n<li>Experience with agile development methodologies and version control systems like Git<\/li>\n<\/ul>\n<p>If you&#8217;re a talented software engineer looking for a new challenge, and you&#8217;re passionate about building scalable, reliable solutions that prioritize user’s payment experience, we encourage you to apply for this exciting opportunity!<\/p>\n<h2><strong>What We Offer:<\/strong><\/h2>\n<ul>\n<li>A dynamic, supportive work environment with a diverse team of engineers and cross-functional partners<\/li>\n<li>Opportunities for professional growth and development, with a focus on continuous learning and skill-building<\/li>\n<li>A competitive salary and benefits package, with a focus on work-life balance and employee well-being<\/li>\n<li>Flexible work arrangements, including remote work options, to support your individual needs and preferences<\/li>\n<li>The chance to work on high-impact projects that drive real results for our users and advertisers<\/li>\n<\/ul>\n<h2><strong>Benefits:<\/strong><\/h2>\n<ul>\n<li>Comprehensive Healthcare Benefits<\/li>\n<li>401k Matching<\/li>\n<li>Workspace benefits for your home office<\/li>\n<li>Personal &amp; Professional development funds<\/li>\n<li>Family Planning Support<\/li>\n<li>Flexible Vacation (please use them!) &amp; Reddit Global Wellness Days<\/li>\n<li>4+ months paid Parental Leave<\/li>\n<li>Paid Volunteer time off<\/li>\n<\/ul>\n<h2><strong>Pay Transparency:<\/strong><\/h2>\n<p>This job posting may span more than one career level.<\/p>\n<p>In addition to base salary, this job is eligible to receive equity in the form of restricted stock units, and depending on the position offered, it may also be eligible to receive a commission. Additionally, Reddit offers a wide range of benefits to U.S.-based employees, including medical, dental, and vision insurance, 401(k) program with employer match, generous time off for vacation, and parental leave. To learn more, please visit https:\/\/www.redditinc.com\/careers.<\/p>\n<p>To provide greater transparency to candidates, we share base pay ranges for all US-based job postings regardless of state. We set standard base pay ranges for all roles based on function, level, and country location, benchmarked against similar stage growth companies. Final offer amounts are determined by multiple factors including, skills, depth of work experience and relevant licenses\/credentials, and may vary from the amounts listed below.<\/p>\n<p>The base pay range for this position is: $130,000<!-- --> &#8211; <!-- -->$182,000<!-- --> <!-- -->USD<\/p>",
            "pubDate": "2024-11-23 04:43:29",
            "annualSalaryMin": "130000",
            "annualSalaryMax": "182000",
            "salaryCurrency": "USD"
        },
        {
            "id": 112743,
            "url": "https:\/\/jobicy.com\/jobs\/112743-sales-engineer-2",
            "jobSlug": "112743-sales-engineer-2",
            "jobTitle": "Sales Engineer",
            "companyName": "Astronomer",
            "companyLogo": "https:\/\/jobicy.com\/data\/server-nyc0409\/galaxy\/mercury\/2022\/08\/7a77cfb5b26b29196d5ed8cd14a3103a.jpg",
            "jobIndustry": [
                "Sales"
            ],
            "jobType": [
                "full-time"
            ],
            "jobGeo": "USA",
            "jobLevel": "Any",
            "jobExcerpt": "Astronomer designed Astro, an industry-leading data orchestration and observability platform for data teams. Powered by Airflow, Astro accelerates building reliable data products that unlock insights, unleash AI value, and drive data-driven applications. We’re a globally-distributed and rapidly growing venture-backed team of learners, innovators and collaborators. Our mission is to empower data teams to bring mission-critical&#8230;",
            "jobDescription": "<p>Astronomer designed Astro, an industry-leading data orchestration and observability platform for data teams. Powered by Airflow, Astro accelerates building reliable data products that unlock insights, unleash AI value, and drive data-driven applications.<\/p>\n<p>We’re a globally-distributed and rapidly growing venture-backed team of learners, innovators and collaborators. Our mission is to empower data teams to bring mission-critical analytics, AI, and software to life.  As a member of our team, you will be at the forefront of the industry as we strive to deliver the world&#8217;s data.<\/p>\n<p>Your background may be unconventional; as long as you have the essential qualifications, we encourage you to apply. While having &#8220;bonus&#8221; qualifications makes for a strong candidate, Astronomer values diverse experiences. Many of us at Astronomer haven&#8217;t followed traditional career paths, and we welcome it if yours hasn&#8217;t either.<\/p>\n<h2><strong>About this role:<\/strong><\/h2>\n<p>As a Sales Engineer at Astronomer, you’ll be a key partner to our clients, guiding them in deploying powerful data workflows to accelerate their business outcomes. You&#8217;ll have the chance to work with cutting-edge technology, help customers solve complex data challenges, and influence our product’s evolution through client feedback. This role is ideal for someone who wants to make a visible impact while growing into an expert in workflow orchestration and Apache Airflow.<\/p>\n<h2><strong>What you get do:<\/strong><\/h2>\n<ul>\n<li><strong>Solve Real-World Problems<\/strong>: Design and implement proof-of-concept solutions that help customers tackle real data challenges, from concept to production.<\/li>\n<li><strong>Be a Trusted Advisor<\/strong>: Conduct demos and provide technical guidance to engineering teams, showing them how our platform can transform their workflows.<\/li>\n<li><strong>Drive Community Impact<\/strong>: Contribute to the Apache Airflow community by creating technical content and best practices, positioning Astronomer as a thought leader in workflow orchestration.<\/li>\n<li><strong>Influence Product Direction<\/strong>: Act as a liaison by gathering field insights and providing critical feedback to the Product team to shape the future of our platform.<\/li>\n<li><strong>Develop and Grow<\/strong>: Become an expert in Airflow, workflow orchestration, and the data engineering landscape as you collaborate across departments and work on impactful projects.<\/li>\n<\/ul>\n<h2><strong>What you bring <\/strong> to the role:<\/h2>\n<ul>\n<li><strong>Experience and Expertise<\/strong>: 2+ years in a Sales Engineering, Solutions Engineering, Consulting or similar role within the data space, ideally with experience in modern data tools like Snowflake, Databricks, Fivetran, or Tableau.<\/li>\n<li><strong>Data Engineering Know-How<\/strong>: Familiarity with core data engineering concepts such as orchestration, ELT, Git, and Role-Based Access Control (RBAC).<\/li>\n<li><strong>Effective Communication<\/strong>: Strong verbal and written communication skills to simplify complex technical concepts for diverse audiences.<\/li>\n<li><strong>Curiosity and Customer Empathy<\/strong>: A genuine desire to understand customer needs, patience, and empathy to support them through challenges.<\/li>\n<li><strong>Drive to Innovate<\/strong>: Eagerness to learn and experiment with new technical concepts, tools, and approaches to stay ahead in the data industry.<\/li>\n<\/ul>\n<h2><strong>Bonus points  if you have<\/strong><\/h2>\n<ul>\n<li>Hands-on Python scripting skills for data pipeline support.<\/li>\n<li>Experience with Apache Airflow or other open-source data tools.<\/li>\n<li>Background in designing data workflows in a production environment.<\/li>\n<li>Customer-facing experience in a technical or consultative role.<\/li>\n<li>Experience working with Command Line Interfaces (CLI).<\/li>\n<\/ul>\n<h2><strong>Why Astronomer? <\/strong><\/h2>\n<ul>\n<li><strong>Impactful Mission<\/strong>: Join a team that’s transforming data workflows and making big data accessible and manageable for all.<\/li>\n<li><strong>Growth Opportunities<\/strong>: We support your career development through mentorship, training, and pathways for internal growth.<\/li>\n<li><strong>Open Culture<\/strong>: As a remote-friendly company, we embrace flexible work arrangements and believe in a collaborative, inclusive environment.<\/li>\n<li><strong>Unique Perks<\/strong>: Enjoy competitive benefits, work-from-home stipend, and opportunities to connect with a global community of innovators in data.<\/li>\n<\/ul>\n<p><em>The estimated total compensation for this role ranges from $200,000 &#8211; $265,000, along with an equity component. This range is merely an estimate, and the width of the range reflects willingness to consider candidates with broad prior seniority. Actual compensation may deviate from this range based on skills, experience, and qualifications.<\/em><\/p>\n<p>At Astronomer, we value diversity. We are an equal opportunity employer: we do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.  Astronomer is a remote-first company.<\/p>",
            "pubDate": "2024-11-23 04:33:25",
            "annualSalaryMin": "200000",
            "annualSalaryMax": "265000",
            "salaryCurrency": "USD"
        },
        {
            "id": 108700,
            "url": "https:\/\/jobicy.com\/jobs\/108700-senior-data-scientist-core",
            "jobSlug": "108700-senior-data-scientist-core",
            "jobTitle": "Sr. Data Scientist - Core",
            "companyName": "Pinterest",
            "companyLogo": "https:\/\/jobicy.com\/data\/server-nyc0409\/galaxy\/mercury\/2022\/01\/86709a608bd914b28221164e6680ebf7.jpeg",
            "jobIndustry": [
                "Data Science"
            ],
            "jobType": [
                "full-time"
            ],
            "jobGeo": "USA",
            "jobLevel": "Senior",
            "jobExcerpt": "As a Data Scientist in our Core organization, you will shape the future of people-facing and business-facing products we build at Pinterest. Your expertise in quantitative modeling, experimentation and algorithms will be utilized to solve some of the most complex engineering challenges at the company. You will collaborate on a wide array of product and&#8230;",
            "jobDescription": "<p>As a Data Scientist in our Core organization, you will shape the future of people-facing and business-facing products we build at Pinterest. Your expertise in quantitative modeling, experimentation and algorithms will be utilized to solve some of the most complex engineering challenges at the company. You will collaborate on a wide array of product and business problems with a diverse set of cross-functional partners across Product, Engineering, Design, Research, Product Analytics, Data Engineering and others. The results of your work will influence and uplevel our product development teams while introducing greater scientific rigor into the real world products serving hundreds of millions of pinners, creators, advertisers and merchants around the world.<\/p>\n<h2><strong>What you’ll do:<\/strong><\/h2>\n<ul>\n<li>Develop best practices for instrumentation and experimentation and communicate those to product engineering teams to help us fulfill our mission &#8211; to bring everyone the inspiration to create a life they love<\/li>\n<li>Bring scientific rigor and statistical methods to the challenges of product creation, development and improvement with an appreciation for the behaviors of our Pinners<\/li>\n<li>Build and prototype analysis pipelines iteratively to provide insights at scale while developing comprehensive knowledge of data structures and metrics, advocating for changes where needed for product development<\/li>\n<li>Work cross-functionally to build and communicate key insights, and collaborate closely with product managers, engineers, designers, and researchers to help build the next experiences on Pinterest<\/li>\n<\/ul>\n<h2><strong>What we’re looking for:<\/strong><\/h2>\n<ul>\n<li>5+ years of experience analyzing data in a fast-paced, data-driven environment with proven ability to apply scientific methods to solve real-world problems on web-scale data<\/li>\n<li>Extensive experience solving analytical problems using quantitative approaches including in the fields of Machine Learning, Statistical Modeling, Forecasting, Econometrics or other related fields<\/li>\n<li>Experience using machine learning and deep learning frameworks, such as PyTorch, TensorFlow or scikit-learn<\/li>\n<li>A scientifically rigorous approach to analysis and data, and a well-tuned sense of skepticism, attention to detail and commitment to high-quality, results-oriented output<\/li>\n<li>Ability to manipulate large data sets with high dimensionality and complexity; fluency in SQL (or other database languages) and a scripting language (Python or R)<\/li>\n<li>Excellent communication skills and ability to explain learnings to both technical and non-technical partners<\/li>\n<li>A team player who’s able to partner with cross-functional leadership to quickly turn insights into actions<\/li>\n<\/ul>\n<h2><strong>Relocation Statement:<\/strong><\/h2>\n<ul>\n<li>This position is not eligible for relocation assistance. Visit our PinFlex page to learn more about our working model.<\/li>\n<\/ul>\n<p>At Pinterest we believe the workplace should be equitable, inclusive, and inspiring for every employee. In an effort to provide greater transparency, we are sharing the base salary range for this position. The position is also eligible for equity. Final salary is based on a number of factors including location, travel, relevant prior experience, or particular skills and expertise.<\/p>\n<p>US based applicants only $123,470—$254,024 USD<\/p>\n<h2><strong>Our Commitment to Diversity:<\/strong><\/h2>\n<p>Pinterest is an equal opportunity employer and makes employment decisions on the basis of merit. We want to have the best qualified people in every job. All qualified applicants will receive consideration for employment without regard to race, color, ancestry, national origin, religion or religious creed, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, age, marital status, status as a protected veteran, physical or mental disability, medical condition, genetic information or characteristics (or those of a family member) or any other consideration made unlawful by applicable federal, state or local laws. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.<\/p>",
            "pubDate": "2024-11-23 04:22:09",
            "annualSalaryMin": "123470",
            "annualSalaryMax": "254024",
            "salaryCurrency": "USD"
        },
        {
            "id": 111763,
            "url": "https:\/\/jobicy.com\/jobs\/111763-solutions-engineer-4",
            "jobSlug": "111763-solutions-engineer-4",
            "jobTitle": "Solutions Engineer",
            "companyName": "Shippo",
            "companyLogo": "https:\/\/jobicy.com\/data\/server-nyc0409\/galaxy\/mercury\/2021\/01\/WRILS-210105054741-917528.png",
            "jobIndustry": [
                "Software Engineering"
            ],
            "jobType": [
                "full-time"
            ],
            "jobGeo": "USA",
            "jobLevel": "Any",
            "jobExcerpt": "As a Solutions Engineer at Shippo, you will play a critical role in our sales and customer success efforts for our high-volume clients, including large volume D2C merchants, emerging partners, and managed D2M accounts. You will work closely with our sales team to provide our prospects and clients with technical expertise. You will be responsible&#8230;",
            "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>As a Solutions Engineer at Shippo, you will play a critical role in our sales and customer success efforts for our high-volume clients, including large volume D2C merchants, emerging partners, and managed D2M accounts. You will work closely with our sales team to provide our prospects and clients with technical expertise. You will be responsible for understanding our client&#8217;s business requirements and using your technical expertise to design and implement solutions that meet their needs. You will also work closely with our product and engineering teams to provide feedback on the product and help improve the overall user experience.<\/div>\n<h2><b>Shipping &amp; handling responsibilities:<\/b><\/h2>\n<ul>\n<li>Act as a technical advisor to our sales team and prospects, with a focus on high-volume clients<\/li>\n<li>Understand client requirements and design solutions to meet their needs using the Shippo API<\/li>\n<li>Support the delivery of product demonstrations and technical presentations to potential clients and existing customers<\/li>\n<li>Assist with the development of proposals and statements of work<\/li>\n<li>Help develop proof-of-concept solutions to showcase Shippo&#8217;s product capabilities<\/li>\n<li>Create and drive customer onboarding plans<\/li>\n<li>Collaborate with sales, product, and engineering teams to ensure smooth integration and delivery of solutions.<\/li>\n<li>Capture and share product feedback with the product and engineering teams to help grow our offering<\/li>\n<li>Contribute to creating and maintaining technical documentation and training materials<\/li>\n<li>Stay informed about industry trends and emerging technologies to enhance your technical skills and knowledge<\/li>\n<\/ul>\n<\/div>\n<div class=\"section page-centered\">\n<div>\n<h2>Requirements:<\/h2>\n<ul>\n<li>Ability to clearly articulate technical issues and solutions to both technical and non-technical stakeholders<\/li>\n<li>Experience identifying, diagnosing, and resolving issues related to APIs, ensuring smooth integration and performance<\/li>\n<li>Strong understanding of SQL for querying databases and troubleshooting data-related issues<\/li>\n<li>Ability to effectively explain API-related issues to customers, offering clear, actionable solutions<\/li>\n<li>Ability to read and understand Python code for debugging and issue identification purposes<\/li>\n<\/ul>\n<\/div>\n<\/div>\n<div class=\"section page-centered\">\n<div>\n<h2>Bonus:<\/h2>\n<ul>\n<li>Bonus if prior working experience is in Shipping, eCommerce,  or Warehouse\/3PL environment<\/li>\n<\/ul>\n<\/div>\n<\/div>\n<div class=\"section page-centered\" data-qa=\"closing-description\">\n<h2>Our Compensation <b>Ship<\/b>policy:<\/h2>\n<div>We believe compensation is a custom experience and are commited to fair and equitable compensation practices. The standard base pay range for this role is min $114k to a max $155k annual salary (standard range). We tend to anchor our offers in the mid point ($135k). Since we are focused on hiring Shippos Everywhere, we have 2 US pay ranges, a standard compensation range for the majority of the US and a standard +1 compensation range for those who live in areas where the cost of labor is higher, such as NYC and California.<\/div>\n<div><\/div>\n<div>The actual base pay is dependent upon many factors, such as: financial budgets, work experience, training, transferable skills, business needs, and market value. The base pay salary ranges are subject to change and may be modified in the future. Total compensation for this role will include, equity, medical, dental, vision and other benefits noted in our Shippos “package” section.<\/div>\n<\/div>",
            "pubDate": "2024-11-22 05:18:35"
        },
        {
            "id": 110899,
            "url": "https:\/\/jobicy.com\/jobs\/110899-solutions-architect",
            "jobSlug": "110899-solutions-architect",
            "jobTitle": "Solutions Architect",
            "companyName": "Gremlin",
            "companyLogo": "https:\/\/jobicy.com\/data\/server-nyc0409\/galaxy\/mercury\/2020\/10\/WRILS-201027082756-840509.jpg",
            "jobIndustry": [
                "Sales"
            ],
            "jobType": [
                "full-time"
            ],
            "jobGeo": "USA",
            "jobLevel": "Any",
            "jobExcerpt": "Gremlin’s team is growing, and we’re seeking a passionate Solutions Architect to help prove the value of Reliability Management to customers. In this pre- and post-sales role, you will have the opportunity to demonstrate Gremlin Reliability Management and offer guidance on best practices for building reliable architectures.  As customers convert to a paid subscription, you&#8230;",
            "jobDescription": "<p>Gremlin’s team is growing, and we’re seeking a passionate Solutions Architect to help prove the value of Reliability Management to customers. In this pre- and post-sales role, you will have the opportunity to demonstrate Gremlin Reliability Management and offer guidance on best practices for building reliable architectures.  As customers convert to a paid subscription, you will advise on how to design and implement experiments to activate customers for their reliability journey.<\/p>\n<h2><strong>In this role, you&#8217;ll get to:<\/strong><\/h2>\n<ul>\n<li>Demonstrate Gremlin in customer calls and webinars<\/li>\n<li>Partner with sales team to drive technical wins and grow Gremlin’s customer base<\/li>\n<li>Participate and lead proof-of-concepts with potential customers<\/li>\n<li>Educate potential customers on Reliability and Chaos Engineering<\/li>\n<li>Work with existing customers on technical projects and assist in troubleshooting<\/li>\n<li>Consult with customers on the resiliency of their applications and architecture, diagnose gaps and recommend solutions<\/li>\n<li>Participate in technical workshops and conferences<\/li>\n<\/ul>\n<p><strong>Collaborate with different functions of the company including Product Marketing, Support, and Engineering<\/strong><\/p>\n<h2><strong>We&#8217;ll expect you to have:<\/strong><\/h2>\n<ul>\n<li>5+ years of experience as a Solution Architect in a tech company<\/li>\n<li>Excellent verbal and written communication skills<\/li>\n<li>Strong problem-solving skills<\/li>\n<li>Hands on experience with:\n<ul>\n<li>Kubernetes Platforms, Managed and Unmanaged\n<ul>\n<li>AKS, EKS, GKE<\/li>\n<li>OpenShift, Rancher<\/li>\n<li>Certified k8 Administrator is a plus<\/li>\n<li>Linux &#8211; Shell scripting, Certified Linux Administrator is a plus<\/li>\n<li>Container and Container Runtimes<\/li>\n<\/ul>\n<\/li>\n<li>Operating Systems concepts (CPU, Memory, and networking)<\/li>\n<\/ul>\n<\/li>\n<li>Working knowledge of :\n<ul>\n<li>Observability solutions &#8211; Application Performance Management<\/li>\n<li>Load Testing solutions (e.g JMeter, LoadRunner, Grafana K6)<\/li>\n<li>CI\/CD and Automation Tools (e.g. Jenkins, Ansible)<\/li>\n<li>Service Mesh (e.g. Istio), REST APIs and related tools<\/li>\n<li>Familiarity with one or more programming Languages &#8211; Python, Java, Go<\/li>\n<\/ul>\n<\/li>\n<li>Certification and experience with one or more public cloud providers including Amazon Web Services (AWS), Microsoft Azure, or Google Cloud Platform (GCP)<\/li>\n<\/ul>\n<h2>Bonus experience:<\/h2>\n<ul>\n<li>Experience in a SRE or DevOps role resolving production outages<\/li>\n<li>Knowledge of modern DevOps and SRE tools<\/li>\n<li>Integration into ITSM Tools<\/li>\n<\/ul>\n<p><em>*The role does not offer sponsorship employment benefits. <\/em><\/p>\n<p><em>**If you don&#8217;t think you meet all of the criteria below but still are interested in the job, please apply. Nobody checks every box—we’re looking for candidates that are particularly strong in a few areas, and have some interest and capabilities in others.<\/em><\/p>\n<p><strong><em>Gremlin offers a competitive total rewards package, which includes:<\/em><\/strong><\/p>\n<ul>\n<li><em>Base salary<\/em><\/li>\n<li><em>Equity<\/em><\/li>\n<li><em>Healthcare, dental, and vision benefits<\/em><\/li>\n<li><em>401(k) with employer match.<\/em><\/li>\n<li><em>Variable compensation for specific roles.<\/em><\/li>\n<\/ul>\n<p><em>Compensation is based on the candidate’s skills and qualifications.<\/em><\/p>\n<h2>About Gremlin:<\/h2>\n<p><em>Gremlin is a team of industry veterans and people eager to learn from one another. We set the standard for reliability and equip leading organizations with the mindset and expertise needed to drive reliability improvements that move the world forward. We’re backed by top-tier investors Index Ventures, Amplify Partners, and Redpoint Ventures. Our customers love us, and we’re thrilled to be a partner in their success.<\/em><\/p>\n<p><strong><em>What Do We Care About:<\/em><\/strong><\/p>\n<ul>\n<li><strong>We Care about our People<\/strong><\/li>\n<\/ul>\n<p>People are our critical differentiators. The company strives to treat our people with respect, empathy, and dignity. We expect that our people will treat each other similarly. In both cases, we will assume good intent. All are welcome at Gremlin. We know our differences make us stronger and that our best ideas and contributions can come from anyone at any level.<\/p>\n<ul>\n<li><strong>We Care about Collaboration<\/strong><\/li>\n<\/ul>\n<p>Gremlin is strongest when we come together as one team with shared goals. Be the glue, not the glitter. But as a remote company, teamwork and collaboration won’t happen by accident. We approach every challenge as a shared challenge. We rely on each other for diverse perspectives and creative ideas. We celebrate our wins as a team.<\/p>\n<ul>\n<li><strong>We Care about Results<\/strong><\/li>\n<\/ul>\n<p>Be high productivity, low drama. Results matter. To keep our pace, everyone owns the outcomes of their actions and takes action when needed. We reward speed over perfection. We empower each other to iterate and experiment.<\/p>\n<p><em>You are welcome at Gremlin for who you are. The more voices and ideas we have represented in our business, the more we will all flourish, contribute, and build a more reliable internet. Gremlin is a place where everyone can grow and is encouraged. However you identify and whatever background you bring with you, please apply if this sounds like a role that would make you excited to come into work everyday. It’s in our differences that we will find the power to keep building a more reliable internet by building and designing tools used by the best companies in the world<\/em><\/p>",
            "pubDate": "2024-11-22 05:10:51"
        },
        {
            "id": 96172,
            "url": "https:\/\/jobicy.com\/jobs\/96172-senior-or-staff-frontend-engineer-react",
            "jobSlug": "96172-senior-or-staff-frontend-engineer-react",
            "jobTitle": "Senior or Staff Software Engineer - Backend \/ Python",
            "companyName": "Close",
            "companyLogo": "https:\/\/jobicy.com\/data\/server-nyc0409\/galaxy\/mercury\/2020\/09\/Closeio.png",
            "jobIndustry": [
                "Software Engineering"
            ],
            "jobType": [
                "full-time"
            ],
            "jobGeo": "USA",
            "jobLevel": "Senior",
            "jobExcerpt": "Close is a bootstrapped, profitable, 100% remote, ~90 person team of thoughtful individuals who value autonomy and impact. We’re eager to make a product our customers fall in love with over and over again. We  small scaling businesses. Since 2013, we’ve been building a CRM  that focuses on better communication, without the hassle of manual&#8230;",
            "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>Close is a bootstrapped, profitable, 100% remote, ~90 person team of thoughtful individuals who value autonomy and impact. We’re eager to make a product our customers fall in love with over and over again.<\/div>\n<div><\/div>\n<div>We  small scaling businesses. Since 2013, we’ve been building a CRM  that focuses on better communication, without the hassle of manual data entry or complex UI. Our goal: double the productivity of every sales rep.<\/div>\n<div><\/div>\n<div>Our backend tech stack currently consists primarily of Python Flask web apps with our TaskTiger scheduler handling many of the backend asynchronous task processing chores. Our data stores include MongoDB, PostgreSQL, Elasticsearch, and Redis. The underlying infrastructure runs on AWS using a combination of managed services like EKS, MSK, RDS and ElasticCache and non-managed services running on EC2 instances. All of our compute runs through CI\/CD pipelines that build Docker images, run automated tests and deploy to our Kubernetes clusters. Our backend primarily serves a well-documented public API that our front-end JavaScript app consumes. Our infrastructure is heavily automated using Terraform, Ansible and other AWS tools.<\/div>\n<div><\/div>\n<div>We’re looking for high achieving full-time Software Engineers to join our engineering team. Someone who has a good understanding in web technologies and wants to help design, implement, launch, and scale major systems and user-facing features.<\/div>\n<div><\/div>\n<div>You&#8217;re comfortable working in a fast-paced environment with a small and talented team where you&#8217;re supported in your efforts to grow professionally. You&#8217;re able to manage your time well, communicate effectively and collaborate in a fully distributed team.<\/div>\n<\/div>\n<div class=\"section page-centered\">\n<div>\n<h2>Requirements:<\/h2>\n<ul>\n<li>Senior\/Staff level candidates should have 5+ years experience building modern back-end systems. Mid-level candidates should have ~3 years of similar experience and be eager to level up with the right opportunity.<\/li>\n<li>Python experience is preferred but experience in other languages is acceptable if you have a desire to work with Python.<\/li>\n<li>You have hands-on production experience working with MongoDB, PostgreSQL, Elasticsearch, or similar data stores.<\/li>\n<li>You have experience designing, scaling, debugging, and optimizing systems to make them fast and reliable.<\/li>\n<li>You have participated in code reviews and provided overall code quality suggestions to help maintain the structure and quality of the codebase.<\/li>\n<li>You care about the craftsmanship of the code and systems you produce.<\/li>\n<li><b>Located in the USA<\/b>.<\/li>\n<\/ul>\n<\/div>\n<\/div>\n<div class=\"section page-centered\">\n<div>\n<h2>Bonus point if you have:<\/h2>\n<ul>\n<li>Contributed open source code related to our tech stack<\/li>\n<li>Led small project teams building and launching features<\/li>\n<li>Built B2B SaaS products<\/li>\n<li>Worked with complex architectures that support multiple APIs (e.g. REST, GQL, WebSockets) as well as async task and event processing frameworks<\/li>\n<\/ul>\n<\/div>\n<\/div>\n<div class=\"section page-centered\">\n<div>\n<h2>Come help us with projects like:<\/h2>\n<ul>\n<li>Conceiving, designing, building, and launching new user-facing features<\/li>\n<li>Improving the performance and scalability of our GraphQL and REST API.<\/li>\n<li>Improving how we sync millions of sales emails and calendar events each month<\/li>\n<li>Working with Twilio&#8217;s API, WebSockets, and WebRTC to improve our calling features<\/li>\n<li>Building user-facing analytics features that provide actionable insights based on sales activity data<\/li>\n<li>Improving our Elastic search-backed powerful search features<\/li>\n<li>Improving our internal messaging infrastructure using streaming technologies like Kafka and Redis<\/li>\n<li>Building new and enhancing existing integrations with other SaaS platforms like Google’s G Suite, Zapier, and Web Conferencing providers<\/li>\n<\/ul>\n<\/div>\n<\/div>\n<div class=\"section page-centered\">\n<h2>Why Close?<\/h2>\n<ul>\n<li>100% remote company<\/li>\n<li>Choose between working 5 days\/wk (standard full-time) or 4 days\/wk @ 80% pay<\/li>\n<li>5 weeks PTO + Winter Holiday Break with 2 additional PTO days for every year with the company<\/li>\n<li>1 month paid sabbatical every 5 years<\/li>\n<li>Paid parental leave<\/li>\n<li>Medical, Dental, Vision with HSA option (US residents)<\/li>\n<li>401k matching at 6% (US residents)<\/li>\n<li>Dependent care FSA (US residents)<\/li>\n<li>Our story and team <\/li>\n<\/ul>\n<\/div>\n<div class=\"section page-centered\">\n<div>\n<h2>Our Values:<\/h2>\n<ul>\n<li><b>Build a house you want to live in<\/b> &#8212; Examine long-term thinking and action<\/li>\n<li><b>No BS<\/b> &#8212; Practice transparency and honesty, especially when it’s hard<\/li>\n<li><b>Invest in each other<\/b> &#8212; Build successful relationships with your coworkers and customers<\/li>\n<li><b>Discipline equals freedom<\/b> &#8212; Keep your word to yourself and others<\/li>\n<li><b>Strive for greatness <\/b>&#8212; Constantly challenge yourself and others<\/li>\n<\/ul>\n<\/div>\n<\/div>\n<div class=\"section page-centered\">\n<div>\n<h2>How We Work Together:<\/h2>\n<ul>\n<li><b>Productivity, Quality &amp; Impact: <\/b>We don’t track hours. We trust you’re an adult and know best how to prioritize, meet your goals and contribute at a high level.<\/li>\n<li><b>Asynchronous communication &amp; collaboration:<\/b> We have team members all over the world. We don’t expect anyone to work untraditional hours, that means our default is async. Most teams have 2-5 hours of internal meetings weekly.<\/li>\n<li><b>Appreciation for Deep Work:<\/b> *During your normal work day, not after a day of meetings*.<\/li>\n<li><b>Autonomy &amp; Freedom:<\/b> Create a work environment that is sustainable for you. We place a high amount of trust and responsibility with our team members from the start.<\/li>\n<\/ul>\n<\/div>\n<\/div>\n<\/div>",
            "pubDate": "2024-11-22 05:08:03"
        },
        {
            "id": 109836,
            "url": "https:\/\/jobicy.com\/jobs\/109836-solutions-engineer-3",
            "jobSlug": "109836-solutions-engineer-3",
            "jobTitle": "Solutions Engineer",
            "companyName": "V7",
            "companyLogo": "https:\/\/jobicy.com\/data\/server-nyc0409\/galaxy\/mercury\/2022\/01\/01d2f61fa66001f438aa2a65cb0aa9e5.jpg",
            "jobIndustry": [
                "Sales"
            ],
            "jobType": [
                "full-time"
            ],
            "jobGeo": "Europe",
            "jobLevel": "Any",
            "jobExcerpt": "As an Solutions Engineer, you collaborate with sales teams to ensure key V7 customers achieve twice the impact in half the time. You will thrive on understanding technical leaders challenges and requirements and delivering complex solutions and POVs. You are a prototyper at heart with a gift of talking to customers, building relationships, and solving&#8230;",
            "jobDescription": "<p>As an Solutions Engineer, you collaborate with sales teams to ensure key V7 customers achieve twice the impact in half the time. You will thrive on understanding technical leaders challenges and requirements and delivering complex solutions and POVs. You are a prototyper at heart with a gift of talking to customers, building relationships, and solving technical problems with repeatability.<\/p>\n<p>You will join a team a high performing team of four, supporting the wider sales team on key deals and customer proof-of-values. V7 is an self-serve product, however complex problems sometimes require complex solutions that customers don’t always see &#8211; that’s where you come in.<\/p>\n<h2><strong>What you will be be doing<\/strong><\/h2>\n<ul>\n<li><em>Solutions development and presentation: <\/em>You will develop and present workflow implementations within V7 that combine prompt engineering, data ingestion pipelines, and format conversions, solving customer problems in image recognition, document processing, product development and more. You will present your findings to customers alongside sales.<\/li>\n<li><em>Technical integrations:<\/em> You will work with our product team to assist with the integration of new models and ML-Ops tools into V7.<\/li>\n<li><em>Marketplace Integration:<\/em> Develop and maintain the integration into major cloud marketplaces so users can more easily set up V7 on their cloud of choice.<\/li>\n<li><em>Time management:<\/em> Multi-task between up to 5 simultaneous projects delivered in short timeframes. You are a skilled multi-tasker and familiar with project management tools like Linear.<\/li>\n<\/ul>\n<h2><strong>Who you are<\/strong><\/h2>\n<ul>\n<li>Experience delivering Large Language Model projects with customers, including LLM API integration, up-to-speed knowledge of foundation models, SFT (Supervised Fine-Tuning), prompt engineering, RAG (Retrieval-augmented generation) and \/ or measuring AI accuracy.<\/li>\n<li>Two years + experience in solutions architecture or integrating multiple applications \/ data streams, or ML development within customer-facing roles.<\/li>\n<li>Intermediate experience with Python.<\/li>\n<li>University degree in computer science, engineering, mathematics or related fields.<\/li>\n<li>Solutioning: ability to develop and articulate an AI solution vision to technical and business stakeholders with customers and partners to match value proposition to business needs.<\/li>\n<li>Thrived as a another fast-paced SaaS startup or scale-up during a high-growth phase.<\/li>\n<li><em>Preferred to have: expertise with langchain and similar tools for multimodal AI projects.<\/em><\/li>\n<\/ul>\n<h2><strong>What’s in it for you<\/strong><\/h2>\n<ul>\n<li>V7 were named as Linkedin’s No2 top startup in the UK in 2023 and 1st on Sifted’s top B2B rising stars for 2024.<\/li>\n<li>Top 15% quartile stock options through a EMI scheme.<\/li>\n<li>Company wide revenue sharing bonus scheme.<\/li>\n<li>Private Healthcare via Vitality.<\/li>\n<li>Learning and Development wallet of £800 per year.<\/li>\n<li>Monthly well being and mental health budget.<\/li>\n<li>Personalised benefits platform via Thanks Ben.<\/li>\n<li>Enhanced parental leave.<\/li>\n<li>4-day company wide retreats in stunning locations.<\/li>\n<li>Soho London office with a barista, fresh fruit, and other amenities.<\/li>\n<li>Paid tickets, accommodation, and travel to relevant conferences, nationally or internationally (NeurIPS, ICCV, CVPR, &#8230;) to expand your network &amp; knowledge during normal times.<\/li>\n<li>Hybrid working London, UK or remote across Europe timezone eligible.<\/li>\n<\/ul>\n<p><em><strong>What&#8217;s the interview process<\/strong><\/em>: 1st recruiter screen with Sr Talent Acquisition Manager, 2nd Peer interview, 3rd Hiring Manager interview and 4th Product and technical test.<\/p>\n<p>Base salary range: £75K – £85K • Offers Equity • £15K – £20K Commission • £OTE package with uncapped commission paid quarterly.<\/p>",
            "pubDate": "2024-11-21 04:45:35",
            "annualSalaryMin": "75000",
            "annualSalaryMax": "85000",
            "salaryCurrency": "GBP"
        },
        {
            "id": 104258,
            "url": "https:\/\/jobicy.com\/jobs\/104258-senior-data-scientist-13",
            "jobSlug": "104258-senior-data-scientist-13",
            "jobTitle": "Senior Data Scientist",
            "companyName": "Instacart",
            "companyLogo": "https:\/\/jobicy.com\/data\/server-nyc0409\/galaxy\/mercury\/2023\/03\/fe39c2bc9bb5ebb0b5e24318b1f3b60d.jpeg",
            "jobIndustry": [
                "Data Science"
            ],
            "jobType": [
                "full-time"
            ],
            "jobGeo": "Canada",
            "jobLevel": "Senior",
            "jobExcerpt": "This is a general posting for multiple Sr. Data Science roles open across our 4-sided marketplace. You’ll get the chance to learn about the different problems the Data Science team solves as you go through the process. Towards the end of your process, we’ll do a team-matching exercise to determine which of the open roles\/teams&#8230;",
            "jobDescription": "<p>This is a general posting for multiple Sr. Data Science roles open across our 4-sided marketplace. You’ll get the chance to learn about the different problems the Data Science team solves as you go through the process. Towards the end of your process, we’ll do a team-matching exercise to determine which of the open roles\/teams you’ll join. You can find a blurb on each team at the bottom of this page.<\/p>\n<p>With regards to level, we have flexibility. Your level will be determined by your education, years of experience, and most importantly, how you perform throughout the interview process. If you&#8217;re targeting a senior title, you&#8217;ll need to prove to the team that you&#8217;re operating at that level.<\/p>\n<p>You will be joining a growing data science team and will tackle some of the most challenging and impactful problems that are transforming how people buy groceries every day. You will be embedded within our data-driven product team as a trusted partner in uncovering barriers in the product’s usability and utilize these insights to inform product improvements that drive angle-changing growth. We’re looking for a self-driven, strategic thinker who can hit the ground running to ultimately influence decision-making across the entire organization.<\/p>\n<h2><strong>ABOUT THE JOB:<\/strong><\/h2>\n<ul>\n<li>Own analytical frameworks that guide the product roadmap<\/li>\n<li>Design rigorous experiments and interpret results to draw detailed and actionable conclusions<\/li>\n<li>Develop statistical models to extract trends, measure results, and predict future performance of our product<\/li>\n<li>Build simulations to project impact of various product and policy interventions<\/li>\n<li>Enable objective decision making across the company by democratizing data through dashboards and other analytical tools<\/li>\n<li>Use expertise in causal inference, machine learning, complex systems modeling, behavioral decision theory etc. to shape the future of Instacart<\/li>\n<li>Present findings in a compelling way to influence Instacart’s leadership<\/li>\n<\/ul>\n<h2><strong>ABOUT YOU:<\/strong><\/h2>\n<p><strong><em>Minimum Qualifications:<\/em><\/strong><\/p>\n<ul>\n<li>6+ years experience working in a quantitative role at a product company or a research organization<\/li>\n<li>Ability to run rigorous experiments and come up with scientifically sound recommendations<\/li>\n<li>Ability to write complex, efficient, and eloquent SQL queries to extract data<\/li>\n<li>Ability to write efficient and eloquent code in Python or R<\/li>\n<li>A desire to build and improve consumer software products<\/li>\n<li>Ability to translate business needs into analytical frameworks<\/li>\n<li>Eagerness to learn, flexibility to pivot when needed, savviness to navigate and thrive in a dynamic environment, and a growth mindset needed to build a successful team and company<\/li>\n<\/ul>\n<p><strong><em>Preferred Qualifications:<\/em><\/strong><\/p>\n<ul>\n<li>Awareness of business trade offs when working on a multi-sided marketplace<\/li>\n<li>Confidence in collaborating with and influencing cross-functional stakeholders (i.e. Product, Engineering), at a senior level<\/li>\n<li>MS\/PhD in Statistics, Economics, Applied Mathematics, or a similar field<\/li>\n<\/ul>\n<h2><strong>OPEN ROLES:<\/strong><\/h2>\n<p><em>Commerce Platform<\/em><\/p>\n<p><em>This team is a key player in driving affordability for Insacart, through the promotion &amp; adoption of retailer loyalty &amp; discount programs. On this team, you&#8217;ll engage in pricing optimizations at item, category, retailer, and geo levels to foster long-term customer growth. You&#8217;ll evaluate the effects of the platform&#8217;s performance improvements, such as latency reduction for ordering and invoicing. <\/em><\/p>\n<p><em>Growth &amp; Marketing Tech<\/em><\/p>\n<p><em>Instacart&#8217;s marketing data science team serves as thought partners and problem solvers for the Growth and Marketing orgs, supporting our broader mission to give everyone access to the food they love. We are responsible for understanding the end to end scope of growth marketing, including how marketing shapes and impacts customer behavior both today and in the long run, the efficiency and performance of any marketing technology we utilize, and what the highest ROI investments are in both marketing and marketing technology. We synthesize our insights and knowledge into actionable tactics, optimizations, and strategy within marketing.<\/em><\/p>\n<p><em>Marketplace Balancing &amp; Coordination<\/em><\/p>\n<p><em>We are looking for an experienced data scientist with a background in complex and dynamic marketplace problems. The successful candidate will take on a leading role working on Instacart’s core marketplace problems including shopper pay and incentives, marketplace balancing, and experimentation. The role will partner with senior product managers and engineers to tackle analytical, experimental, and inferential problems to understand and expand the efficient frontiers of a balanced, sustainable, and resilient multi-sided marketplace.<br \/>\n<\/em><\/p>\n<p><em>New Bets<\/em><\/p>\n<p><em>The New Bets Data Science team exists to provide data-driven insights and strategic guidance around Instacart’s most promising emerging initiatives, collectively known as &#8220;new bets”. You will play a critical role in supporting these exciting new bets, including Instacart Business and Health, by establishing data foundations, discovering new opportunities, and evaluating success using your business judgement and experimentation. The position requires a scrappy, &#8220;startup-like&#8221; mindset, as you will partner closely with self-directed teams forming new business lines all while leveraging the knowledge and systems of Instacart&#8217;s established marketplace.<\/em><\/p>\n<p><em>Order Experience<\/em><\/p>\n<p><em>We are seeking a Senior Data Scientist to join our Order Experience team at Instacart, with a keen focus on enhancing consumer interactions through strategic data-driven insights. The ideal candidate should be passionate about creating a seamless user experience, focusing on optimizing our critical surfaces such as cart and checkout, and playing a significant role in strategic initiatives like Family Account features. This role requires strong product-facing data science experience, strategic thinking, and adeptness at collaborating with stakeholders to translate complex data into actionable product recommendations.<\/em><\/p>\n<p><em>Retailer Storefronts<\/em><\/p>\n<p>Retailer Storefronts builds white label storefronts for retail partners and committed to being the best digital enablement platform for our retailers, both online and in-store. DSA supports Retailer Storefronts by leveraging observational data to help drive product and marketing strategies grow our and our retailers&#8217; businesses.<\/p>\n<p>Instacart provides highly market-competitive compensation and benefits in each location where our employees work. This role is remote and the base pay range for a successful candidate is dependent on their permanent work location.<\/p>\n<p>Offers may vary based on many factors, such as candidate experience and skills required for the role. Additionally, this role is eligible for a new hire equity grant as well as annual refresh grants.<\/p>\n<p>For Canadian based candidates, the base pay ranges for a successful candidate are listed below.<\/p>\n<p>CAN $158,000<span class=\"divider\">—<\/span>$208,000 CAD<\/p>",
            "pubDate": "2024-11-20 05:13:14",
            "annualSalaryMin": "158000",
            "annualSalaryMax": "208000",
            "salaryCurrency": "USD"
        },
        {
            "id": 107727,
            "url": "https:\/\/jobicy.com\/jobs\/107727-full-stack-developer",
            "jobSlug": "107727-full-stack-developer",
            "jobTitle": "Full Stack Developer",
            "companyName": "Atomic",
            "companyLogo": "https:\/\/jobicy.com\/data\/server-nyc0409\/galaxy\/mercury\/2021\/11\/dfb1cc8654c3b08bce1117b36f882000.png",
            "jobIndustry": [
                "Programming"
            ],
            "jobType": [
                "full-time"
            ],
            "jobGeo": "Canada",
            "jobLevel": "Any",
            "jobExcerpt": "Adentro is a San Francisco-based company backed by the biggest names in Silicon Valley. Our teams enjoy a remote first and highly flexible work culture. Our technical teams are located in Waterloo, Ontario and surrounding areas. This position is available as a remote first position, within Canada. The candidate should be available during core eastern&#8230;",
            "jobDescription": "<p>Adentro is a San Francisco-based company backed by the biggest names in Silicon Valley. Our teams enjoy a remote first and highly flexible work culture. Our technical teams are located in Waterloo, Ontario and surrounding areas. This position is available as a remote first position, within Canada. The candidate should be available during core eastern time zone hours as well as participating in our periodic on-call rotation.<\/p>\n<p>As an experienced Full Stack Developer you will have opportunities to work at all levels of our technology stack, from the customer facing dashboards and back-end business logic, to the high volume data collecting and processing. As a Full Stack Developer you should be comfortable around a range of different technologies and languages, and with the integration of third-party libraries and development frameworks.<\/p>\n<h2>What You&#8217;ll Do<\/h2>\n<ul>\n<li>Work with project stakeholders to understand requirements and ideate software solutions<\/li>\n<li>Design client-side and server-side architectures<\/li>\n<li>Build front-end applications delivering on usability and performance<\/li>\n<li>Build back-end services for scalability and reliability<\/li>\n<li>Write effective APIs and build to third-party APIs<\/li>\n<li>Adhere to security and data protection standards and requirements<\/li>\n<li>Instrument and test software to ensure the highest quality<\/li>\n<li>Monitor, troubleshoot, debug and upgrade production systems<\/li>\n<li>Write technical documentation<\/li>\n<\/ul>\n<h2>What You Have<\/h2>\n<ul>\n<li>Proven experience as a Full Stack Developer or similar role<\/li>\n<li>Comfortable with Golang, Scala, Python, and Kafka, or the desire to learn these technologies<\/li>\n<li>Experience in front-end web development helping to create customer facing user interfaces; experience<\/li>\n<li>with ReactJS a plus<\/li>\n<li>Familiarity with databases and data warehousing such as PostgreSQL, MongoDB, Snowflake<\/li>\n<li>Familiarity with Amazon Web Services cloud platform<\/li>\n<li>Attention to detail, strong organizational skills, and a desire to be part of a team<\/li>\n<li>Degree in Computer Science, Engineering, or relevant field<\/li>\n<\/ul>\n<h2>Our Values<\/h2>\n<ul>\n<li>Be Committed: Work hard, Own the problem, Learn<\/li>\n<li>Create Trust: Do what you say, Create trust with our Clients and Colleagues<\/li>\n<li>Be Bold: Experiment, Speak up, Hope is not a plan<\/li>\n<li>Deliver High Performance: Prepare, Commit, Deliver<\/li>\n<\/ul>\n<h2>Perks and Benefits<\/h2>\n<ul>\n<li>Flexible work-from-home environment<\/li>\n<li>Flexible vacation plan<\/li>\n<li>Excellent benefits package<\/li>\n<li>Education and career development support<\/li>\n<li>Stock options<\/li>\n<\/ul>\n<p>We are focused on building a diverse and inclusive workforce. If you’re excited about this role, but do not meet 100% of the qualifications listed above, we encourage you to apply.<\/p>\n<p>Adentro is an Equal Opportunity Employer and considers applicants for employment without regard to race, color, religion, sex, orientation, national origin, age, disability, genetics or any other basis forbidden under federal, state, or local law.<\/p>",
            "pubDate": "2024-11-20 04:46:56",
            "annualSalaryMin": "100000",
            "annualSalaryMax": "120000",
            "salaryCurrency": "USD"
        },
        {
            "id": 111721,
            "url": "https:\/\/jobicy.com\/jobs\/111721-senior-full-stack-engineer-4",
            "jobSlug": "111721-senior-full-stack-engineer-4",
            "jobTitle": "Intermediate Full Stack Engineer",
            "companyName": "Thinkific",
            "companyLogo": "https:\/\/jobicy.com\/data\/server-nyc0409\/galaxy\/mercury\/2022\/02\/570aa5804532a172e106382d78eee9e2.jpeg",
            "jobIndustry": [
                "Software Engineering"
            ],
            "jobType": [
                "full-time"
            ],
            "jobGeo": "Canada",
            "jobLevel": "Senior",
            "jobExcerpt": "Are you an Intermediate Full Stack Engineer, who is passionate about leading impactful technical projects? We’re looking for an Intermediate Full Stack Engineer to join our team at Thinkific. As an Intermediate Full Stack Engineer, you will work across our application stack to ensure business milestones are met while also investigating, assessing, and fixing defects within the product. You&#8217;ll lead small&#8230;",
            "jobDescription": "<p><strong>Are you an Intermediate Full Stack Engineer, who is passionate about leading impactful technical projects? <\/strong>We’re looking for an <strong>Intermediate<\/strong><strong> Full Stack Engineer<\/strong> to join our team at Thinkific.<\/p>\n<p>As an <strong>Intermediate<\/strong><strong> Full Stack Engineer<\/strong>, you will work across our application stack to ensure business milestones are met while also investigating, assessing, and fixing defects within the product. You&#8217;ll lead small to medium feature projects from conception to completion, working closely with our Engineering, Product Management, and Product Design teams. Reporting to the Engineering Manager, by ensuring seamless delivery of platform features, your contributions will directly impact the quality and efficiency of our platform<\/p>\n<p><strong>Your goal will be to lead feature projects to successful completion and mentor other engineers<\/strong>. Here’s how you’ll accomplish this:<\/p>\n<ul>\n<li>Lead medium to large feature projects in our agile environment, from conception to completion, working with stakeholders  to take projects through shaping, scoping, and execution while mitigating project risks as a team<\/li>\n<li>Author code that is reliable, well-rounded and shows a thorough understanding of our best practices to other team members<\/li>\n<li>Effectively diagnose  and troubleshoot problems within the Thinkific platform<\/li>\n<li>Participate in architectural design, review, and implementation of production-quality features<\/li>\n<li>Actively help others to coordinate and design architecture that is fit for the coding area while identifying common patterns that will reduce technical debt and enable efficiency and quality<\/li>\n<li>Participate in effort and complexity estimation for new\/proposed product features and tasks<\/li>\n<li>Share knowledge with others through mentorship, clear documentation, code reviews, pair programming, and training sessions. Contribute to collaborative and enriching code reviews in an environment of continuous improvement<\/li>\n<li>Work with your team to conduct new technology research; bring fresh ideas and concepts to bear on product development<\/li>\n<li>Foster an open, collaborative, and inclusive environment<\/li>\n<\/ul>\n<h2><strong>The person we have in mind likely<\/strong><\/h2>\n<ul>\n<li>Has 3+ years of experience working in a Full Stack development role, and at least 1+ years of experience working in a SaaS environment<\/li>\n<li>Showcase working experience with modern server-side programming languages (Ruby, Python, Node, etc.)<\/li>\n<li>Familiarity with object-oriented programming paradigm<\/li>\n<li>Is knowledgeable and experienced with modern web frameworks (Ruby on Rails, Django, etc.)<\/li>\n<li>Has experience with ES6 and at least one modern JavaScript libraries\/framework such as React, Svelte, Angular, Vue, etc.<\/li>\n<li>Demonstrates a practical understanding of Web APIs, HTML, CSS and JavaScript<\/li>\n<li>Has experience with RESTful and GraphQL services<\/li>\n<li>Has experience with MVC-style web application architecture and web server technologies like WebSockets, Nginx, etc.<\/li>\n<li>Has experience with relational databases, SQL and engines like PostgreSQL, MySQ<\/li>\n<li>Loves to learn and grow. They’ve found (and keep looking for) ways to level up their skills in this field, whether that’s through formal education, gaining professional experience, or maybe even building their own business<\/li>\n<\/ul>\n<h2><strong>These things would also be nice, but we think you could learn them on the job<\/strong><\/h2>\n<ul>\n<li>Has intermediate to advanced knowledge of front-end languages and frameworks (Javascript, Ember.js, Riot.js, Angular, etc.)<\/li>\n<li>Has senior to advanced knowledge of back-end languages and frameworks. After a few months on the job, able to produce Ruby on Rails code at a senior level with minimal guidance other than peer debates and reviews.<\/li>\n<li>Feels experienced and knowledgeable with NoSQL and key-value database systems handling data at scale.<\/li>\n<\/ul>\n<p><strong>Please note: the majority of this team is located in the PST timezone. Some adherence to PST working hours would be expected.<\/strong><\/p>\n<p><em>The recruitment compensation range for this position is <\/em><em>$119,000 &#8211; $171,00<\/em><em> CAD. Your specific compensation within this range is determined based on your job-related skills, knowledge, experience, and our internal equity assessment.<\/em><\/p>\n<p><strong><em>Diversity, Equity, Inclusion and Belonging &amp; Accessibility<\/em><\/strong><\/p>\n<p><em>This is just our initial idea of who we’re looking for! At Thinkific, we know that people have unique career journeys. If your experience is close to what we’ve described but you feel that you might be missing a few of the requirements, please still apply! We believe in equal opportunity and are committed to diversity, equity, inclusion, and belonging across every facet of our business.<\/em><em>We’re also committed to providing a comfortable and accessible interview experience for every candidate. If there are any accommodations our team can make throughout our hiring process (big or small), please let us know<\/em><\/p>",
            "pubDate": "2024-11-19 04:08:47",
            "annualSalaryMin": "119000",
            "annualSalaryMax": "171000",
            "salaryCurrency": "CAD"
        },
        {
            "id": 17439,
            "url": "https:\/\/jobicy.com\/jobs\/17439-technical-support-engineer-south-asia",
            "jobSlug": "17439-technical-support-engineer-south-asia",
            "jobTitle": "Technical Support Engineer (South Asia)",
            "companyName": "CertiK",
            "companyLogo": "https:\/\/jobicy.com\/data\/server-nyc0409\/galaxy\/mercury\/2021\/03\/Jobicy-210308091023-955845.jpg",
            "jobIndustry": [
                "Software Engineering",
                "Technical Support"
            ],
            "jobType": [
                "full-time"
            ],
            "jobGeo": "APAC",
            "jobLevel": "Any",
            "jobExcerpt": "You are fascinated by security and red teaming. The idea of studying the past attacks excites you. You can go all the way down to the byte code to understand how an attack works. You are not afraid of juggling a large codebase or byte code to unravel the mystery behind anonymous malicious actors.  We are&#8230;",
            "jobDescription": "<div class=\"section page-centered\">\n<div>You are fascinated by security and red teaming. The idea of studying the past attacks excites you. You can go all the way down to the byte code to understand how an attack works. You are not afraid of juggling a large codebase or byte code to unravel the mystery behind anonymous malicious actors.  We are seeking a detail-oriented, thorough, and organized candidate to join our growing team. You’ll require excellent communication, problem-solving,  and interpersonal skills, along with patience, and a customer-friendly attitude.<\/div>\n<div><\/div>\n<div>You are intrigued by the blockchain world and always want to know more about it, or to keep up with the latest development. You are interested in developing your understanding of this field and its security. You are committed to developing familiarity with this community to the extent that you can find most of the information you need from proprietary data sources or OSINT.<\/div>\n<h2>About the role:<\/h2>\n<div>Our customer base is growing fast along with the features we are adding to support them. As a result, we have more questions, feedback, and engagement coming in than ever before. As we have just launched our Discord channel, we need a customer support specialist who can answer both new and old clients&#8217; questions. In this role, you’ll be on the front lines introducing our latest products and features to our clients and community.<\/div>\n<div><\/div>\n<div>As a customer support specialist, you’ll be the customer’s first point of contact as they encounter roadblocks. Because we are constantly adding new features to the existing stack, you are expected to have a keen knowledge of our latest products and be able to provide personalized instructions to customers via social media channels and live chat. You will act as the first point of contact for our Community, respond to the most common questions members may have, and gather all the necessary information before escalating to the higher support levels.<\/div>\n<\/div>\n<div class=\"section page-centered\">\n<div>\n<h2>Requirements:<\/h2>\n<ul>\n<li>2+ years of experience in a customer support role;<\/li>\n<li>Knowledge of analyzing and scaling Discord Community KPIs;<\/li>\n<li>Experience with Discord automation and implementation;<\/li>\n<li>A broad technical background and enjoy learning new technologies;<\/li>\n<li>Capable of explaining complex ideas in plain language;<\/li>\n<li>Professional live chat etiquette;<\/li>\n<li>Discord growth knowledge<\/li>\n<li>Excellent communication skills in English;<\/li>\n<li>Deep interest in and understanding of DeFi &amp; crypto;<\/li>\n<li>Bonus points for speaking other languages, particularly Mandarin;<\/li>\n<\/ul>\n<\/div>\n<\/div>\n<div class=\"section page-centered\">\n<div>\n<h2>Responsibilities:<\/h2>\n<ul>\n<li>Hands-on support activities;<\/li>\n<li>Engage with various stakeholders from our community;<\/li>\n<li>Analyze new trends to engage and develop the discord community;<\/li>\n<li>Ability to create documentation for our community;<\/li>\n<li>Take ownership of clients’ support questions\/issues;<\/li>\n<li>Act as an escalation point for customer complaints\/concerns about the products and service she\/he is engaged with;<\/li>\n<li>As part of a global support team, working on establishing operational protocols and standards;<\/li>\n<li>Research questions using available information resources and advises users on appropriate action;<\/li>\n<li>Working on creating the knowledge Base Articles\/FAQ for our community;<\/li>\n<\/ul>\n<\/div>\n<\/div>\n<div class=\"section page-centered\">\n<div>\n<h2>Bonus Points:<\/h2>\n<ul>\n<li>Knowledge of token economics, knowledge of creating interesting posts for our community.<\/li>\n<li>Knowledge of at least one of the following languages: Java, Python, TypeScript\/Javascript, Bourne Shell.<\/li>\n<\/ul>\n<\/div>\n<\/div>\n<div class=\"section page-centered\">\n<h2>Compensation:<\/h2>\n<div>The exact compensation at which this job is filled will be determined by the skills and experience of qualified candidates.<\/div>\n<\/div>\n<div><\/div>\n<div>\n<div>CertiK is proud to be an equal opportunity employer. We will not discriminate against any applicant or employee on the basis of age, race, color, creed, religion, sex, sexual orientation, gender, gender identity or expression, medical condition, national origin, ancestry, citizenship, marital status or civil partnership\/union status, physical or mental disability, pregnancy, childbirth, genetic information, military and veteran status, or any other basis prohibited by applicable federal, state or local law.<\/div>\n<\/div>",
            "pubDate": "2024-11-19 04:06:20"
        },
        {
            "id": 108604,
            "url": "https:\/\/jobicy.com\/jobs\/108604-developer-application-support-consultant",
            "jobSlug": "108604-developer-application-support-consultant",
            "jobTitle": "Developer &amp; Application Support Consultant",
            "companyName": "Splunk",
            "companyLogo": "https:\/\/jobicy.com\/data\/server-nyc0409\/galaxy\/mercury\/2021\/09\/2f9304fe9b427489507405bef9a0bb9f.jpg",
            "jobIndustry": [
                "Technical Support"
            ],
            "jobType": [
                "full-time"
            ],
            "jobGeo": "USA",
            "jobLevel": "Any",
            "jobExcerpt": "Splunk is here to build a safer and more resilient digital world. The world&#8217;s leading enterprises use our unified security and observability platform to keep their digital systems secure and reliable. While customers love our technology, it&#8217;s our people that make Splunk stand out as an amazing career destination and why we&#8217;ve won so many&#8230;",
            "jobDescription": "<div>Splunk is here to build a safer and more resilient digital world. The world&#8217;s leading enterprises use our unified security and observability platform to keep their digital systems secure and reliable. While customers love our technology, it&#8217;s our people that make Splunk stand out as an amazing career destination and why we&#8217;ve won so many awards as a best place to work. If you become a Splunker, we want your whole, authentic self, what we call your &#8220;million data points&#8221;. So bring your work experience, problem-solving skills and talent, of course, but also bring your joy, your passion and all the things that make you, you.<\/div>\n<h2>Role Summary<\/h2>\n<div>We are looking for a customer obsessed Developer &amp; Application Support Consultant to join our AMER Support team. In this role you will be part of a team that takes pride in delivering an outstanding Application Development support experience. Your primary role involves collaborating with a team of Consultants and Engineers responsible for assisting Application Developers in resolving technical issues within the Splunk Apps space. Duties include prioritizing case work, managing case issues, creating great Support experiences, and ensuring an exceptional Customer Service Experience. You will be customer focused, independent, positive, self-motivated, proactive, outcome-driven, and able to monitor and deliver on your team&#8217;s performance metrics. You are both curious and collaborative by nature and enjoy mentoring and developing team members.<\/div>\n<div>In Splunk Support we LOVE to disrupt, we innovate to deliver exceptional customer and employee experience. Diversity matters, we harness our unique strengths to deliver the best outcomes. We work closely with several different parts of the organization to learn and educate each other, then we build the right solution for all parties; transparency is at our core. We have fun doing extraordinary work with great people. Come become one of us.<\/div>\n<div>Find out more information below!<\/div>\n<h2>What you&#8217;ll get to do<\/h2>\n<div>Provide outstanding service and technical support to Splunk App developers and maintain positive customer relationships<\/div>\n<ul>\n<li>Take ownership of resolving App developers problems while ensuring an outstanding customer experience<\/li>\n<li>Develop and maintain a deep understanding of the Splunk product and related technologies, with a focus on our Splunk Apps space.<\/li>\n<li>Troubleshoot technical issues to establish the root cause of problems and form a solution or workaround across a range of environments<\/li>\n<li>Create, reuse, improve, and maintain quality knowledge articles as part of the case management workflow, while following Knowledge-Centered Service principles and methodology<\/li>\n<li>Reproduce customer issues, file bug reports, raise issues to Engineering, and be the bridge between customers and product developers<\/li>\n<li>Drive continuous improvement of tools, processes, and product supportability<\/li>\n<li>Perform other job-related duties as assigned and participate in special projects<\/li>\n<\/ul>\n<h2><b>Skills<\/b><\/h2>\n<ul>\n<li>Detailed and organized, with a track record for understanding urgency and delivering quality results.<\/li>\n<li>Proven ability to deal with complex customer issues while using an empathetic approach that builds and maintains a strong customer bond.<\/li>\n<li>Demonstrated skill at recognizing business improvements and opportunities while working with customers.<\/li>\n<li>Ability to multi-task and perform effectively under pressure, juggling multiple time-sensitive priorities.<\/li>\n<li>Demonstrated ability to take an issue and own it to completion, without the need for escalation, even if it requires going over and above to complete the task.<\/li>\n<li>Comfortable hosting calls with multiple attendees, both technical and non-technical.<\/li>\n<li>Ability to provide ‘Value Added Support’ while investigating, developing and delivering creative business solutions for complex customer problems.<\/li>\n<li>Passionate about helping and educating customers on Splunk Best Practices.<\/li>\n<li>Demonstrated confidence in dealing with all levels of management, both internal and customer.<\/li>\n<li>Excellent written and verbal communication skills.<\/li>\n<li>Demonstrates a mature, balanced approach to work\/home priorities.<\/li>\n<\/ul>\n<h2>Must-have Qualifications<\/h2>\n<ul>\n<li>8+ years Technical\/ Customer Support or equivalent experience.<\/li>\n<li>Outstanding interpersonal skills, and excellent communication &#8211; both verbal and written<\/li>\n<li>Strong Splunk platform knowledge and experience. Preferably Splunk Cloud Certified Admin.<\/li>\n<li>Successful completion of the Building Splunk Apps training course.<\/li>\n<li>3 years Splunk Admin experience with a proven track record of producing successful Splunk Apps or Addons.<\/li>\n<li>3 years of experience and demonstrated competency using Python, UNIX(Linux), Java, .Net, Shell scripting, Splunk REST API with GO as a plus.<\/li>\n<li>3 years of experience using Splunk SDK<\/li>\n<li>Experience in technical support, system administration, or similar technical role.<\/li>\n<li>Experience with cloud-based technologies and an understanding of modern application architecture. (Splunk Cloud preferred)<\/li>\n<li>Startup and hyper growth experience.<\/li>\n<li>Logical approach to problem solving with strong troubleshooting skills<\/li>\n<li>Excellent time management skills with the ability to adapt to changing priorities of customer issues<\/li>\n<li>Passionate about working in a dynamic technical environment and supporting a product with frequent product releases and regular maintenance updates<\/li>\n<\/ul>\n<div><b>Splunk is an Equal Opportunity Employer:<\/b><\/div>\n<div><\/div>\n<div>At Splunk, we believe creating a culture of belonging isn’t just the right thing to do; it’s also the smart thing. We prioritize diversity, equity, inclusion, and belonging to ensure our employees are supported to bring their best, most authentic selves to work where they can thrive. Qualified applicants receive consideration for employment without regard to race, religion, color, national origin, ancestry, sex, gender, gender identity, gender expression, sexual orientation, marital status, age, physical or mental disability or medical condition, genetic information, veteran status, or any other consideration made unlawful by federal, state, or local laws. We consider qualified applicants with criminal histories, consistent with legal requirements.<\/div>\n<h2><b>Base Pay Range<\/b><\/h2>\n<p>SF Bay Area, Seattle Metro, and New York City Metro Area<br \/>\nBase Pay Range: $133,600.00 &#8211; 183,700.00 per year<\/p>\n<p>California (excludes SF Bay Area), Washington (excludes Seattle Metro), Washington DC Metro, and Massachusetts<br \/>\nBase Pay Range: $120,240.00 &#8211; 165,330.00 per year<\/p>\n<p>All other cities and states excluding California, Washington, Massachusetts, New York City Metro Area and Washington DC Metro Area.<br \/>\nBase Pay Range: $106,880.00 &#8211; 146,960.00 per year<\/p>\n<p>Splunk provides flexibility and choice in the working arrangement for most roles, including remote and\/or in-office roles. We have a market-based pay structure which varies by location. Please note that the base pay range is a guideline and for candidates who receive an offer, the base pay will vary based on factors such as work location as set out above, as well as the knowledge, skills and experience of the candidate. <b>In addition to base pay, this role is eligible for incentive compensation and may be eligible for equity or long-term cash awards.<\/b><\/p>",
            "pubDate": "2024-11-19 03:55:55",
            "annualSalaryMin": "106880",
            "annualSalaryMax": "146960",
            "salaryCurrency": "USD"
        },
        {
            "id": 108602,
            "url": "https:\/\/jobicy.com\/jobs\/108602-senior-machine-learning-engineer-2",
            "jobSlug": "108602-senior-machine-learning-engineer-2",
            "jobTitle": "Senior Machine Learning Engineer - Hotels Flexibility",
            "companyName": "Hopper",
            "companyLogo": "https:\/\/jobicy.com\/data\/server-nyc0409\/galaxy\/mercury\/2020\/10\/WRILS-201020164254-931520.jpg",
            "jobIndustry": [
                "Software Engineering"
            ],
            "jobType": [
                "full-time"
            ],
            "jobGeo": "Canada,  USA",
            "jobLevel": "Senior",
            "jobExcerpt": "As a Senior Machine Learning Engineer, your focus will be on solving data and engineering challenges. This will enable Hopper to offer products that assist our customers in dealing with common travel issues. This role involves working with Hopper&#8217;s fintech products and focuses on delivering these products to millions of travelers worldwide. Your primary responsibility&#8230;",
            "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>As a Senior Machine Learning Engineer, your focus will be on solving data and engineering challenges. This will enable Hopper to offer products that assist our customers in dealing with common travel issues.<\/div>\n<div><\/div>\n<div>This role involves working with Hopper&#8217;s fintech products and focuses on delivering these products to millions of travelers worldwide. Your primary responsibility will be to enhance existing machine learning pricing models and to develop and deploy new frameworks to improve our product pricing.<\/div>\n<div><\/div>\n<div>You will be responsible for the entire development, deployment, and performance tracking of models across multiple platforms.<\/div>\n<\/div>\n<div class=\"section page-centered\">\n<div>\n<h2>What your day-to-day would look like:<\/h2>\n<ul>\n<li>Ensure we are priced correctly based on changing demand environments and external conditions. Identify segments where we are mispriced and deploy scalable solutions to correct pricing models<\/li>\n<li>Think beyond “just the model” by challenging existing product construction and UX, and building data-backed business cases to ship alternatives that improve the customer experience<\/li>\n<li>Initiate, develop, and maintain data pipelines that power our decision making<\/li>\n<li>Measure business performance by identifying and refining KPI metrics and creating reporting frameworks to continuously monitor them<\/li>\n<li>Find new opportunities for revenue growth by becoming the expert on our data and customers<\/li>\n<\/ul>\n<\/div>\n<\/div>\n<div class=\"section page-centered\">\n<div>\n<h2>An ideal candidate has:<\/h2>\n<ul>\n<li>A proven track record of solving complex problems with in depth understanding of data, product and business impact<\/li>\n<li>High attention to detail and ability to create scalable data solutions<\/li>\n<li>Strong creative problem-solving skills and critical thinking competencies<\/li>\n<li>Ability to effectively communicate pricing decisions and performance to executive-level stakeholders<\/li>\n<li>Designed, implemented, and deployed pricing models into production using modern technologies<\/li>\n<li>Fluency in using SQL for data creation, maintenance and analysis<\/li>\n<li>High proficiency in Python, ML workflows, and ETL pipeline exposure.<\/li>\n<li>Experience with data visualization to convey ML models behavior and business insights<\/li>\n<li>Worked on a consumer product and has shipped high impact models at scale<\/li>\n<\/ul>\n<\/div>\n<\/div>\n<div class=\"section page-centered\">\n<div>\n<h2>Perks &amp; Benefits:<\/h2>\n<ul>\n<li>Well-funded and proven startup with large ambitions, competitive salary and the upsides of pre-IPO equity packages<\/li>\n<li>Unlimited PTO<\/li>\n<li>Carrot Cash travel stipend<\/li>\n<li>Flexdesk All Access Pass AND Work-from-home stipend<\/li>\n<li>Please ask us about our very generous parental leave, much above industry standards!<\/li>\n<li>Entrepreneurial culture where pushing limits and taking risks is everyday business<\/li>\n<li>Open communication with management and company leadership<\/li>\n<li>Small, dynamic teams = massive impact<\/li>\n<li>100% employer paid medical, dental, vision, disability and life insurance plans<\/li>\n<li>Up to 4000$ per year in Health Reimbursement Account (HRA)<\/li>\n<li>FSA\/ DCA: Hopper offers pre-tax deduction for out-of-pocket expenditures for health and dependent care costs.<\/li>\n<li>Access to a 401K plan<\/li>\n<li>Annual maximum** is $3,200 for health care, and $5000 for dependent care.<\/li>\n<\/ul>\n<\/div>\n<\/div>\n<div class=\"section page-centered\" data-qa=\"salary-range\">\n<div><i>The yearly total compensation for this senior position ranges from $150,000 to $350,000 USD. Compensation will be determined by candidates&#8217; relevant qualifications, knowledge, skills and work experience.<\/i><\/div>\n<div><\/div>\n<div><i>Total compensation can include a solid base salary and will also include equity (options \/ RSUs), sign-on bonus and other potential incentives.<\/i><\/div>\n<\/div>\n<div class=\"section page-centered\" data-qa=\"closing-description\">\n<h2><b>More about Hopper:<\/b><\/h2>\n<div>At Hopper, we are on a mission to become the leading travel platform globally – powering Hopper’s mobile app, website and our B2B business, HTS (Hopper Technology Solutions). By leveraging massive amounts of data and advanced machine learning algorithms, Hopper combines its world-class travel agency offering with proprietary fintech products to bring transparency, flexibility and savings to travelers globally. We have developed several unique fintech solutions that address everything from pricing volatility to trip disruptions – helping people travel better and save more on their trips.<\/div>\n<div><\/div>\n<div>The Hopper platform serves hundreds of millions of travelers globally and continues to capture market share around the world. Ranked the third largest online travel agency in North America, the Hopper app has been downloaded over 120 million times and has become largely popular among younger travelers – with 70% of its users being Gen Z and millennials.<\/div>\n<div><\/div>\n<div>While everyone knows us as the Gen Z and Millennial travel app, Hopper has evolved to become much more than that. In recent years, we’ve grown into a global travel agency and travel fintech provider that powers some of the world’s largest brands.<\/div>\n<\/div>",
            "pubDate": "2024-11-19 03:51:01",
            "annualSalaryMin": "150000",
            "annualSalaryMax": "350000",
            "salaryCurrency": "USD"
        },
        {
            "id": 112607,
            "url": "https:\/\/jobicy.com\/jobs\/112607-data-scientist-10",
            "jobSlug": "112607-data-scientist-10",
            "jobTitle": "Data Scientist",
            "companyName": "Study.com",
            "companyLogo": "https:\/\/jobicy.com\/data\/server-nyc0409\/galaxy\/mercury\/2021\/12\/afe1b9a77c70df67176408a79f4fd27a.png",
            "jobIndustry": [
                "Data Science"
            ],
            "jobType": [
                "full-time"
            ],
            "jobGeo": "Mexico",
            "jobLevel": "Any",
            "jobExcerpt": "We&#8217;re looking for a Data Scientist to join our growing team.  The ideal candidate is passionate about all aspects of data – digging deep to explain observations or gain business insights, turning complex data into intuitive visualizations, transforming it to simplify future tasks and building machine learning models to provide the business with accurate predictions&#8230;.",
            "jobDescription": "<p>We&#8217;re looking for a Data Scientist to join our growing team.  The ideal candidate is passionate about all aspects of data – digging deep to explain observations or gain business insights, turning complex data into intuitive visualizations, transforming it to simplify future tasks and building machine learning models to provide the business with accurate predictions.<\/p>\n<p><strong>This position is a full-time contract role and is required to work Monday-Friday during Pacific business hours.<\/strong><\/p>\n<h2><strong>What You’ll Do:<\/strong><\/h2>\n<ul>\n<li>Create and update ETLs as our source data and data needs evolve<\/li>\n<li>Build data visualizations and reports using Tableau<\/li>\n<li>Build, maintain, and improve machine learning models (neural networks, logistic regressions, boosted trees, k-means clustering, etc.)<\/li>\n<li>Share ownership and maintenance responsibilities of our entire data warehouse, including 50-100 million events coming through a Kafka queue each day, a 20 node Cassandra cluster, a 15 TB relational database, and an integration with Google BigQuery.<\/li>\n<li>Innovate! We&#8217;re a team that likes to stay on the cutting edge.  Everyone is expected to always be looking for ways to leverage the latest technology to improve our processes and drive better results.<\/li>\n<\/ul>\n<h2><strong>What You’ll Bring To The Role:<\/strong><\/h2>\n<ul>\n<li>5-7 years of experience in a Data Science or related role (experience with web analytics is a plus)<\/li>\n<li>BS in Mathematics, Statistics, Computer Science, or related field (master’s degree or PhD a plus)<\/li>\n<li>Strong proficiency in SQL (Google BigQuery and MySQL)<\/li>\n<li>Experience writing code (Python and Java\/Groovy)<\/li>\n<li>A willingness to work in a face-paced, dynamic environment while juggling multiple projects<\/li>\n<li>A passion for innovation and learning with a driven mindset<\/li>\n<li>Excellent communication and presentation skills<\/li>\n<\/ul>\n<h2><strong>Nice To Have:<\/strong><\/h2>\n<ul>\n<li>Experience creating complex data visualizations with Tableau<\/li>\n<li>Hands-on experience with advanced statistical concepts, such as cluster analysis, singular value decomposition, gradient descent, etc.<\/li>\n<li>Knowledge of web analytics software and best practices<\/li>\n<li>Strong ability to use Generative AI (e.g. ChatGPT, copilot, etc.) to assist with technical tasks<\/li>\n<\/ul>\n<p>At Study.com, we know that strong communities are built on the power of our diversity, and we respect and strive to understand for the diverse identities, race, ethnicities, backgrounds, and perspectives of our team members. Our work and company culture have been consistently recognized, including:<\/p>\n<ul>\n<li>Inc. Best Place to Work<\/li>\n<li>Fortune Great Places to Work – Best Workplaces in the Bay Area<\/li>\n<li>Golden Bridge Awards – Gold Winner, Corporate Social Responsibility<\/li>\n<li>San Francisco Business Times &amp; Silicon Valley Business Journal – Best Places to Work<\/li>\n<\/ul>\n<p>Study.com provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, veteran or disability status. In addition to federal law requirements.<\/p>",
            "pubDate": "2024-11-18 04:54:41"
        },
        {
            "id": 73899,
            "url": "https:\/\/jobicy.com\/jobs\/73899-research-engineer",
            "jobSlug": "73899-research-engineer",
            "jobTitle": "Research Engineer",
            "companyName": "Chainlink Labs",
            "companyLogo": "https:\/\/jobicy.com\/data\/server-nyc0409\/galaxy\/mercury\/2022\/02\/ec6e8f7f8fae8ec7d526de901c0a044a.jpeg",
            "jobIndustry": [
                "Software Engineering"
            ],
            "jobType": [
                "full-time"
            ],
            "jobGeo": "Anywhere",
            "jobLevel": "Any",
            "jobExcerpt": "Chainlink Labs is seeking Research Engineers to support its mission of building the world’s most secure and flexible decentralized oracle technologies. Research Engineers will work directly with top domain experts in applied cryptography, mechanism design (crypto economics), distributed systems, and other disciplines to identify and solve key research challenges and build production solutions that keep Chainlink at&#8230;",
            "jobDescription": "<p>Chainlink Labs is seeking Research Engineers to support its mission of building the world’s most secure and flexible decentralized oracle technologies. Research Engineers will work directly with top domain experts in applied cryptography, mechanism design (crypto economics), distributed systems, and other disciplines to identify and solve key research challenges and build production solutions that keep Chainlink at the forefront of oracle system deployment and fuel the success of the smart contract ecosystem.<\/p>\n<h2><strong>Your Impact<\/strong><\/h2>\n<ul>\n<li>Working with Chainlink core engineering to identify short- and long-term research challenges critical to the company’s success and to transition innovations from Chainlink Labs into production.<\/li>\n<li>Working with research scientists and technical advisors to study, invent, and build cutting-edge oracle technologies for the benefit of the company and community.<\/li>\n<li>Staying abreast of the evolution of relevant technology ecosystems and participating in relevant technical communities for more effective application development and to guide research toward practical and impactful work.<\/li>\n<\/ul>\n<h2><strong>Required Qualifications<\/strong><\/h2>\n<ul>\n<li>B.S. in computer science or equivalent professional experience along with coursework in algorithms and data structures and discrete math.<\/li>\n<li>Familiarity with academic process and ability to engage with existing literature on relevant research topics, e.g. by performing literature searches and comprehending papers in a wider context.<\/li>\n<li>Professional software development experience is required.<\/li>\n<\/ul>\n<h2><strong>Preferred Qualifications<\/strong><\/h2>\n<ul>\n<li>Advanced computer science or related degree, coursework in applied and theoretical cryptography, mechanism design, distributed systems, or related fields.<\/li>\n<li>Familiarity with Go or Rust.<\/li>\n<li>Broad knowledge of blockchain technologies and familiarity specifically with smart contracts.<\/li>\n<\/ul>\n<h2><strong>Our Stack<\/strong><\/h2>\n<ul>\n<li>We use Go, Typescript, Solidity, Python, LATEX, git, and Linux\/Unix.<\/li>\n<\/ul>\n<p><em>All roles with Chainlink Labs are global and remote-based. Unless otherwise stated, we ask that you try to overlap some working hours with Eastern Standard Time (EST).<\/em><\/p>\n<h2><strong>Commitment to Equal Opportunity<\/strong><\/h2>\n<p>Chainlink Labs is an equal opportunity employer. All qualified applicants will receive equal consideration for employment in compliance with applicable laws, regulations, or ordinances.<\/p>",
            "pubDate": "2024-11-18 04:47:06"
        },
        {
            "id": 111692,
            "url": "https:\/\/jobicy.com\/jobs\/111692-staff-engineer",
            "jobSlug": "111692-staff-engineer",
            "jobTitle": "Staff Engineer",
            "companyName": "Varsity Tutors",
            "companyLogo": "https:\/\/jobicy.com\/data\/server-nyc0409\/galaxy\/mercury\/2021\/03\/Jobicy-210313085850-559044.jpg",
            "jobIndustry": [
                "Software Engineering"
            ],
            "jobType": [
                "full-time"
            ],
            "jobGeo": "Canada,  USA",
            "jobLevel": "Any",
            "jobExcerpt": "We are looking for a Staff Software Engineer based in North America to join our mission to help people learn! This is a great opportunity to work with an amazing team and drive the technology of learning products and platforms. We operate in a highly collaborative environment with Product and Design to build experiences that&#8230;",
            "jobDescription": "<p>We are looking for a Staff Software Engineer based in North America to join our mission to help people learn!<\/p>\n<p>This is a great opportunity to work with an amazing team and drive the technology of learning products and platforms. We operate in a highly collaborative environment with Product and Design to build experiences that matter to our customers. At Nerdy, engineers do not just write code; they actively participate in the conversation on what and how to build the systems and solutions that matter to our customers. If you love your customers as much as we do, we&#8217;d love to hear from you.<\/p>\n<p>The Staff Engineer will assume a dual role as a technical leader and a visionary for our highly complex and high-performing systems. In this capacity, they will not only provide technical guidance and mentorship to the team but also play a pivotal role in shaping and driving the overarching vision of our system, aimed at enhancing the experience for our tutors and optimizing our tutor-supply chain.<\/p>\n<p>This position is a full-time remote opportunity. (We&#8217;ve been remote-friendly for years, and that isn&#8217;t going away.)<\/p>\n<h2><strong>About the Team: <\/strong><\/h2>\n<p>The Engagement team owns our student customer-facing systems, including our digital classroom and learning tools &#8211; the experiences that students learn in. If you want to have direct, meaningful impact on our customers’ learning this is the place! You will architect scalable software solutions, understand and implement best practices, and create technology that is highly performant and extensible.<\/p>\n<h2><strong>About Nerdy: <\/strong><\/h2>\n<p>Nerdy (NYSE: NRDY), the parent company of Varsity Tutors, is a leading platform for live online learning, with a mission to transform the way people learn through technology. The Company’s purpose-built proprietary platform leverages technology, including Machine Learning and AI (Nerdy AI Learning Products &#8211; Press Release), to connect learners of all ages to experts, delivering superior value on both sides of the network. Nerdy’s comprehensive learning destination provides learning experiences across 3,000+ subjects and multiple formats—including one-on-one instruction, small group classes, large format group classes, on-demand study support, and adaptive self-study. Nerdy’s flagship business, Varsity Tutors, is one of the nation’s largest platforms for live online tutoring and classes. Its solutions are available directly to students and consumers, as well as through schools and other institutions. Learn more about Nerdy at https:\/\/www.nerdy.com.<\/p>\n<h2><strong>Key Responsibilities<\/strong><\/h2>\n<ul>\n<li>Technical Leadership: Serve as the technical point of reference for the squad and broader engineering team, ensuring best practices and architectural standards are upheld.<\/li>\n<li>Solution Design: Lead the design and architectural discussions, making pivotal decisions on technologies, frameworks, and design patterns.<\/li>\n<li>Code Quality: Advocate for and ensure the delivery of high-quality, maintainable, and scalable code. Conduct regular code reviews and provide mentorship to team members.<\/li>\n<li>Collaboration: Work closely with product managers, designers, and other stakeholders to understand requirements, provide technical insights, and ensure the timely delivery of features.<\/li>\n<li>Strategy and Vision: Contribute to the engineering department&#8217;s strategy and vision, bringing innovative ideas to improve our customer-facing experiences.<\/li>\n<li>Problem Solving: Address complex technical challenges, innovate solutions, and optimize existing systems for scalability and performance.<\/li>\n<li>Team Development: Mentor and develop team members, helping them to grow in their technical roles and careers.<\/li>\n<\/ul>\n<h2><strong>Qualifications: <\/strong><\/h2>\n<ul>\n<li>Minimum of 10 years of software engineering experience with a proven track record of working on complex systems.<\/li>\n<li>Experience with one of our core languages: Go, Ruby, Python &#8211; with a strong preference for Go.<\/li>\n<li>Explicit mentoring of senior-level engineers regularly, leading to results.<\/li>\n<li>Significant experience in AWS or GCP-based cloud architecture environments.<\/li>\n<li>In-depth knowledge of modern software engineering practices, design patterns, and architectures.<\/li>\n<li>Ability to communicate complex technical concepts clearly to both technical and non-technical stakeholders.<\/li>\n<li>Demonstrated experience in collaborating with multidisciplinary teams.<\/li>\n<li>Excellent problem-solving and analytical skills.<\/li>\n<li>A strong owner willing to roll up their sleeves. This role includes coding and reviewing the code of others.<\/li>\n<li>Ability to implement customer-facing solutions that solve the customers’ true needs.<\/li>\n<li>Nerdy is an apolitical company focused solely on helping people learn, and we achieve the most when united in this mission.<\/li>\n<\/ul>\n<h2><strong>Benefits:<\/strong><\/h2>\n<ul>\n<li>Competitive Salary plus Equity in the company.<\/li>\n<li>Healthcare Plans (Medical, Dental, Vision, Life).<\/li>\n<li>401k Company Matching Plan.<\/li>\n<li>PTO and Company Holidays.<\/li>\n<li>Remote work environment.<\/li>\n<li>Maternity, Paternal, and Adoption Leave.<\/li>\n<li>Free Learning Membership for you and your household (1-1 tutoring hours, unlimited use of on-demand services, and access to our online classes).<\/li>\n<li>Once-in-a-lifetime opportunity to help transform how the world learns!<\/li>\n<li>Fun, collaborative, and team-oriented work environment with plenty of training and a feedback-rich culture.<\/li>\n<\/ul>\n<p><strong>Nerdy Leadership Principles<\/strong><\/p>\n<p>Relentless Focus on Customers * Comfort with Ambiguity * Ownership * Simplify * Intellectual Curiosity * Build Teams * Think Big * Insist on High Standards * Bias for Action * Build Trust * Go Deep * Have Conviction * Deliver Results * Are Right, a Lot<\/p>\n<p><em>Nerdy is committed to creating a diverse environment and is proud to be an equal-opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.<\/em><\/p>",
            "pubDate": "2024-11-18 04:33:59"
        },
        {
            "id": 17394,
            "url": "https:\/\/jobicy.com\/jobs\/17394-senior-manager-analytics-marketing",
            "jobSlug": "17394-senior-manager-analytics-marketing",
            "jobTitle": "Senior Analytics Manager, Marketing",
            "companyName": "Thrasio",
            "companyLogo": "https:\/\/jobicy.com\/data\/server-nyc0409\/galaxy\/mercury\/2022\/01\/70894814667c3f6e6944c2947ecd9cba.jpeg",
            "jobIndustry": [
                "Marketing &amp; Sales"
            ],
            "jobType": [
                "full-time"
            ],
            "jobGeo": "USA",
            "jobLevel": "Senior",
            "jobExcerpt": "We’ve got huge goals, and every Thrasher plays an integral part in getting us there. That’s why we only bring on people who think positively. Who look out for the team. Who tell their egos to take a hike while they get the job done right. From the moment you become a Thrasher, we give&#8230;",
            "jobDescription": "<div class=\"section page-centered\">\n<div>We’ve got huge goals, and every Thrasher plays an integral part in getting us there. That’s why we only bring on people who think positively. Who look out for the team. Who tell their egos to take a hike while they get the job done right.<\/div>\n<div><\/div>\n<div>From the moment you become a Thrasher, we give you the freedom you need to take big swings and push what’s possible to get us there. And if you fail, it’s cool—we know you’ll grow spectacularly. What matters is that you’re helping impact millions of people around the world who use our products everyday.<\/div>\n<div><\/div>\n<div>Because with every new spatula or pillow brand we grow, with every kitchen scale we develop, our goal is to provide people everywhere with what they need to make the most of every moment &#8211; ensuring that what gets delivered to their door <i>delivers<\/i>.<\/div>\n<div><\/div>\n<div>The Head of Analytics Marketing will drive the development of Thrasio’s platform that manages the execution and experimentation of our advertising spend across multiple marketing channels and ecommerce platforms. They will use analytics to measure the performance of the platform and play a leadership role in collaboration with Product, Engineering, Data Science, and Marketing Channel stakeholders.<\/div>\n<\/div>\n<div class=\"section page-centered\">\n<div>\n<h2>Day to Day Responsibilities:<\/h2>\n<ul>\n<li>Use analytics to develop novel approaches to optimize marketing spend then partner with data science and engineering teams to launch at scale<\/li>\n<li>Leverage deep understanding of statistics and technical programming skills (Python, R, SQL, etc.) to help your team conduct advanced analytics on large data sets to identify opportunities and validate hypotheses.<\/li>\n<li>Drive operational excellence through real time monitoring, alerting and automation to ensure a rapid response to changes in market dynamics and customer\/supplier behaviors<\/li>\n<li>Communicate the team vision and progress to C-level stakeholders.<\/li>\n<li>Build a team of high performing analysts and thoughtfully divide and allocate the roadmap across them<\/li>\n<\/ul>\n<\/div>\n<\/div>\n<div class=\"section page-centered\">\n<div>\n<h2>Minimum Qualifications:<\/h2>\n<ul>\n<li>5+ years work experience in a relevant analytics field working with automated algorithmic systems. Experience in Amazon’s ad ecosystem, PPC advertising, ACoS targeting and other ad platforms a plus (e.g. Google PLA, SEO optimization )<\/li>\n<li>Demonstrated success working with executives at the most senior levels, developing an analytics roadmap, and providing recommendations that direct business strategy and achieve high impact results<\/li>\n<li>Strong quantitative reasoning and ability to proactively deep dive and dig into data and KPIs.<\/li>\n<li>Excellent communication and stakeholder management skills at the senior leadership level.<\/li>\n<\/ul>\n<\/div>\n<\/div>\n<div class=\"section page-centered\">\n<div>\n<h2>Nice to Have, but Not Required:<\/h2>\n<ul>\n<li>Coding skills are a plus (Sql, Python, R etc)<\/li>\n<\/ul>\n<p>We believe that all employees should be paid fairly and equitably.  As of the time of this posting, the expected base annual salary range for this position is $135,000 to $215,000.  (For non-exempt roles, this reflects the expected base annual “salary” as calculated by the base hourly wage multiplied by the expected number of hours worked over a one year period, excluding any overtime and premiums.)   The actual base annual salary will be based on a wide range of factors, including your skills, qualifications, and experience, as well as business needs and limitations.  As a result, compensation may vary within and across similar roles and positions. Please note that the base annual salary range information set forth above is a good faith estimate for this position and actual compensation for any individual may fall outside this range if warranted by the circumstances applicable to that individual. If we identify a role that would be suitable for a broader range of skills and experience such that we would consider hiring at multiple levels, then the range listed above may reflect that breadth.  If offered a position, the actual base annual salary will be contained in your offer letter.<\/p>\n<\/div>\n<\/div>",
            "pubDate": "2024-11-17 05:07:21",
            "annualSalaryMin": "135000",
            "annualSalaryMax": "215000",
            "salaryCurrency": "USD"
        }
    ]
}